{
  "Toggle navigation": "Chuyển đổi điều hướng",
  "Logo": "Biểu tượng",
  "Courses": "Khóa học",
  "Tools": "Công cụ",
  "Musics": "Âm nhạc",
  "Search": "Tìm kiếm",
  "Theme": "Giao diện",
  "Language": "Ngôn ngữ",
  "Login": "Đăng nhập",
  "Signup": "Đăng ký",
  "See more": "Xem thêm",
  "Contact": "Liên hệ",
  "About me": "Giới thiệu",
  "Privacy policy": "Chính sách quyền riêng tư",
  "Security policy": "Chính sách bảo mật",
  "Other projects": "Dự án khác",
  "Magento Project": "Dự án Magento",
  "NodeJs Project": "Dự án NodeJs",
  "Subscribe to our newsletter": "Theo dõi bản tin của chúng tôi",
  "Monthly digest of what's new and exciting from us.": "Thông báo hàng tháng về những gì mới và thú vị từ chúng tôi.",
  "Email address": "Địa chỉ email",
  "Subscribe": "Đăng ký",
  "Responsible for the content": "Chịu trách nhiệm về nội dung",
  "No. 8, My A Street, Dong My, Thanh Tri, City. Hanoi": "Số 8. đường Mỹ Ả, Đông Mỹ, Thanh Trì, Hà Nội",
  "Address detail": "Chi tiết địa chỉ",
  "Phone number": "Số điện thoại",
  "Email": "Thư điện tử",
  "Hello, I am Tri Nguyen Duc": "Xin chào, tôi là Nguyễn Đức Trí",
  "I love the Information Technology field and have a passion for Web Programming.": "Tôi yêu thích lĩnh vực Công nghệ thông tin và đam mê Lập trình Web.",
  "Overview": "Tổng quan",
  "Personal information": "Thông tin cá nhân",
  "PHP programmer": "Lập trình viên PHP",
  "Am a software developer with significant experience in PHP programming": "Là một nhà phát triển phần mềm có kinh nghiệm đáng kể về lập trình PHP",
  "With Laravel, I have the ability to build diverse web applications and manage databases effectively": "Với Laravel, tôi có khả năng xây dựng các ứng dụng web đa dạng và quản lý cơ sở dữ liệu một cách hiệu quả",
  "At the same time, I worked with Magento 2 to customize and develop e-commerce features": "Đồng thời, tôi làm việc với Magento 2 để tùy chỉnh và phát triển các tính năng thương mại điện tử",
  "Full name": "Họ & tên",
  "Home town": "Quê quán",
  "Hanoi, Vietnam": "Hà Nội, Việt Nam",
  "Socials": "Mạng xã hội",
  "Project": "Dự án",
  "Type": "Loại",
  "Enterprise": "Doanh nghiệp",
  "Individual": "Cá nhân",
  "Technology": "Công nghệ",
  "Introduce": "Giới thiệu",
  "Genki Sushi Hong Kong bestsellers comprise sushi, sashimi, light foods, hot dishes, desserts and kids": "Genki Sushi Hồng Kông bán chạy nhất bao gồm sushi, sashimi, đồ ăn nhẹ, món nóng, món tráng miệng và đồ ăn trẻ em",
  "Galle Genuine Watch System is gradually increasing its position as the number 1 watch distributor in Vietnam": "Hệ thống Đồng hồ Chính hãng Galle đang dần nâng cao vị thế là nhà phân phối đồng hồ số 1 tại Việt Nam",
  "Shop thousands products (beauty, clothing, lifestyle) and order takeaway foods from Lee Gardens": "Mua sắm hàng ngàn sản phẩm (sắc đẹp, quần áo, phong cách sống) và đặt mua đồ ăn mang đi từ Lee Gardens",
  "ROUTINE is a famous, high-end fashion clothing brand in Vietnam, specializing in genuine everyday wear": "ROUTINE là thương hiệu quần áo thời trang cao cấp, nổi tiếng tại Việt Nam, chuyên quần áo hàng ngày chính hãng",
  "Practice CRUD, Authentication, OAuth operations on Laravel with MySQL Database": "Thực hành các thao tác CRUD, Authentication, OAuth trên Laravel với MySQL Database",
  "Get familiar with Back-end development using NodeJs, MongoDB, GraphQL. Deploy the project on the Product environment (Ubuntu)": "Làm quen với việc phát triển Back-end bằng NodeJs, MongoDB, GraphQL. Triển khai dự án trên môi trường Product (Ubuntu)",
  "Quick view": "Xem nhanh",
  "Business": "Doanh nghiệp",
  "Powerful, flexible e-commerce platform": "Nền tảng thương mại điện tử mạnh mẽ, linh hoạt",
  "Powerful web application development framework": "Khung phát triển ứng dụng web mạnh mẽ",
  "Reliable and flexible web development framework": "Khung phát triển web đáng tin cậy và linh hoạt",
  "JavaScript library that optimizes DOM processing": "Thư viện JavaScript tối ưu hóa xử lý DOM",
  "High-performance server-side JavaScript code execution environment": "Môi trường thực thi mã JavaScript phía máy chủ hiệu suất cao",
  "Popular, open source database management system": "Hệ thống quản lý cơ sở dữ liệu mã nguồn mở phổ biến",
  "NoSQL database management system, flexible JSON storage": "Hệ thống quản lý cơ sở dữ liệu NoSQL, lưu trữ JSON linh hoạt",
  "Flexible and efficient data query language": "Ngôn ngữ truy vấn dữ liệu linh hoạt và hiệu quả",
  "A JavaScript library used to build flexible and efficient user interfaces.": "Thư viện JavaScript dùng để xây dựng giao diện người dùng linh hoạt và hiệu quả.",
  "Programming framework": "Khung giao diện lập trình",
  "Library": "Thư viện",
  "Database": "Cơ sở dữ liệu",
  "Others": "Khác",
  "Personal skills": "Kỹ năng bản thân",
  "Web Development": "Phát triển Web",
  "Use experience handling Framework, Library Back-End and Front-End in designing, deploying and maintaining Website and Webapp": "Sử dụng kinh nghiệm xử lý Framework, Library Back-End và Front-End trong thiết kế, triển khai, bảo trì Website, Webapp",
  "Database Optimization": "Tối ưu Cơ sở dữ liệu",
  "Provide solutions for data management and system monitoring": "Đưa ra giải pháp về quản lý dữ liệu và giám sát hệ thống",
  "Report data security risks and remediate known security vulnerabilities": "Báo cáo các rủi ro an toàn dữ liệu và khắc phục các lỗ hổng bảo mật đã biết",
  "Server Deployment": "Triển khai Máy chủ",
  "Create, maintain, upgrade Cloud VPS servers and support Hosting solutions for small and medium businesses.": "Khởi tạo, bảo trì, nâng cấp máy chủ Cloud VPS và hỗ trợ giải pháp Hosting cho doanh nghiệp vừa và nhỏ.",
  "Table of contents": "Mục lục",
  "Personal data we collect": "Dữ liệu cá nhân chúng tôi thu thập",
  "Sensitive personal data we collect": "Dữ liệu cá nhân nhạy cảm chúng tôi thu thập",
  "Share your personal data": "Chia sẻ dữ liệu cá nhân của quý khách",
  "Third party providers": "Các nhà cung cấp bên thứ ba",
  "Your rights": "Các quyền của quý khách",
  "Data security": "Bảo mật dữ liệu",
  "Options center": "Trung tâm tùy chọn",
  "This website is operated by Tri Nguyen Duc": "Trang web này được điều hành bởi Nguyễn Đức Trí",
  "We process a variety of personal data, such as names, email addresses and information related to the services I provide": "Chúng tôi xử lý nhiều loại dữ liệu cá nhân, ví dụ như tên, địa chỉ email và thông tin liên quan đến dịch vụ tôi cung cấp",
  "Therefore, we take data security very seriously and strictly comply with data protection laws": "Do đó, chúng tôi rất coi trọng việc bảo mật dữ liệu và tuân thủ nghiêm ngặt luật bảo vệ dữ liệu",
  "This privacy policy explains how we collect, store, use and disclose any personal data we collect about you when you use this website, and how we I protect your privacy and personal information security": "Chính sách quyền riêng tư này giải thích cách chúng tôi thu thập, lưu trữ, sử dụng và tiết lộ bất kỳ dữ liệu cá nhân nào mà chúng tôi thu thập về quý khách khi quý khách sử dụng trang web này, cũng như cách chúng tôi bảo vệ quyền riêng tư và bảo mật thông tin cá nhân của quý khách",
  "Your privacy is important to us so whether you're new to our services or are a long-time user, please take the time to learn about our practices - and get in touch us if you have any questions.": "Quyền riêng tư của quý khách quan trọng với chúng tôi vì vậy dù quý khách mới sử dụng dịch vụ của chúng tôi hay là người dùng lâu năm, vui lòng dành thời gian để tìm hiểu các thông lệ của chúng tôi - và liên hệ với chúng tôi nếu quý khách có bất kỳ thắc mắc nào.",
  "Typically, the type of personal data we collect is information we need to enable you to provide warranty and service support": "Thông thường, loại dữ liệu cá nhân chúng tôi thu thập là thông tin chúng tôi cần để cho phép quý khách khách hàng hỗ trợ bảo hành và dịch vụ",
  "This information includes information such as your full name, date of birth, phone number and email address": "Thông tin này bao gồm các thông tin như họ và tên, ngày sinh, số điện thoại và địa chỉ email của quý khách",
  "The personal data that we must receive in order to be able to help you arrange your order for products that you have placed through our website is the only data that is required to be provided": "Dữ liệu cá nhân mà chúng tôi phải nhận được để có thể giúp quý khách sắp xếp đơn hàng sản phẩm mà quý khách đã đặt qua trang web của chúng tôi là dữ liệu duy nhất bắt buộc phải cung cấp",
  "Depending on the type of travel service you use, we may also collect your frequent flyer number, information about your dietary requirements and health issues (if any) guests and other details relating to your travel arrangements or information requested by another travel service provider (such as airlines and hotels)": "Tùy thuộc vào loại dịch vụ du lịch quý khách sử dụng, chúng tôi cũng có thể thu thập mã số khách bay thường xuyên, thông tin về các yêu cầu về chế độ ăn uống và các vấn đề sức khỏe (nếu có) của quý khách cùng các thông tin chi tiết khác liên quan đến việc sắp xếp chuyến du lịch của quý khách hoặc thông tin được yêu cầu bởi một nhà cung cấp dịch vụ du lịch khác (chẳng hạn như hãng hàng không và khách sạn)",
  "This is not a complete list": "Đây không phải là danh sách đầy đủ",
  "If you call our support department, we will collect the data you provide during the call": "Nếu quý khách gọi cho bộ phận hỗ trợ của chúng tôi, chúng tôi sẽ thu thập dữ liệu quý khách cung cấp trong khi gọi",
  "As you can see below, our cookies also collect some information.": "Như quý khách có thể thấy bên dưới, các cookie của chúng tôi cũng thu thập một số thông tin.",
  "If you make a booking for someone else through our website, we will request that person's personal data": "Nếu quý khách đặt chỗ trước cho người khác thông qua trang web của chúng tôi, chúng tôi sẽ yêu cầu dữ liệu cá nhân của người đó",
  "In those cases, we expect you to inform those individuals of this privacy policy.": "Trong những trường hợp đó, chúng tôi mong quý khách sẽ thông báo cho các cá nhân đó về chính sách quyền riêng tư này.",
  "In some cases, we may process “special categories of personal data” about you, which may be considered sensitive": "Trong một số trường hợp, chúng tôi có thể xử lý “các hạng mục dữ liệu cá nhân đặc biệt” về quý khách, có thể được coi là nhạy cảm",
  "For example, if you (i) have submitted a medical certificate to avail of cancellation benefits or a refund from the airline (ii) have a medical or health condition that affects your trip go and you require assistance or where certain authorization is required, or (iii) have requested the disclosure of certain other sensitive personal data about you.": "Ví dụ, nếu quý khách (i) đã gửi giấy chứng nhận sức khỏe để sử dụng dịch vụ bảo vệ quyền lợi khi hủy hoặc để hoàn tiền từ hãng hàng không (ii) có tình trạng y tế hoặc sức khỏe ảnh hưởng đến chuyến đi và quý khách yêu cầu hỗ trợ hoặc khi cần sự cho phép nhất định, hoặc (iii) đã yêu cầu tiết lộ một số dữ liệu cá nhân nhạy cảm khác về quý khách.",
  "Before processing sensitive personal data about you, we will ask for your consent": "Trước khi xử lý các dữ liệu cá nhân nhạy cảm về quý khách, chúng tôi sẽ xin sự chấp thuận của quý khách",
  "We therefore request that you use the dedicated contact forms on our website to submit any sensitive data": "Do đó, chúng tôi yêu cầu quý khách sử dụng các biểu mẫu liên hệ chuyên dụng trên trang web của chúng tôi để gửi bất kỳ dữ liệu nhạy cảm nào",
  "The contact forms allow you to provide us with the consent required under applicable data protection laws": "Các biểu mẫu liên hệ cho phép quý khách cung cấp cho chúng tôi sự chấp thuận được yêu cầu theo luật bảo vệ dữ liệu hiện hành",
  "You can of course withdraw this consent at any time": "Tất nhiên quý khách có thể rút lại sự chấp thuận này bất cứ lúc nào",
  "We will not process any sensitive personal data without your consent, or that you have not provided to us": "Chúng tôi sẽ không xử lý bất kỳ dữ liệu cá nhân nhạy cảm nào không được quý khách cho phép, hoặc quý khách chưa cung cấp cho chúng tôi",
  "A limited number of our employees will have access to your sensitive personal data and, after processing the sensitive data at your request, we will delete it as soon as possible.": "Một số lượng hạn chế nhân viên của chúng tôi sẽ có quyền truy cập dữ liệu cá nhân nhạy cảm của quý khách và sau khi xử lý dữ liệu nhạy cảm theo yêu cầu của quý khách, chúng tôi sẽ xóa dữ liệu sớm nhất có thể.",
  "In addition to the above, we take the necessary day-to-day measures for businesses providing services to consumers, such as bookkeeping, accounting, payments, anti-money laundering obligations and maintain the security of our website": "Ngoài những điều trên, chúng tôi thực hiện các biện pháp hàng ngày cần thiết đối với các doanh nghiệp cung cấp dịch vụ cho người tiêu dùng, chẳng hạn như ghi sổ, kế toán, thanh toán, thực hiện nghĩa vụ chống rửa tiền và duy trì tính bảo mật trang web của chúng tôi",
  "To the extent this is not required under applicable law, we take these measures based on our legitimate interests": "Trong phạm vi điều này không bắt buộc theo luật hiện hành, chúng tôi thực hiện các biện pháp này dựa trên lợi ích hợp pháp của mình",
  "We may also analyze customer behavior to improve our websites and services on a general level": "Chúng tôi cũng có thể phân tích hành vi của khách hàng để cải thiện các trang web và dịch vụ của chúng tôi ở mức độ tổng quát",
  "However, this analysis will use aggregated or anonymized data at an aggregate level.": "Tuy nhiên, hoạt động phân tích này sẽ sử dụng dữ liệu tổng quát hoặc ẩn danh ở mức độ tổng hợp.",
  "We will only share your personal data as necessary for the purposes listed in this privacy policy": "Chúng tôi sẽ chỉ chia sẻ dữ liệu cá nhân của quý khách khi cần cho các mục đích được liệt kê trong chính sách quyền riêng tư này",
  "May be shared with other companies in https://devhongzui.com, government agencies and our trusted business partners": "Có thể chia sẻ cho các công ty khác trong https://devhongzui.com, các cơ quan chính phủ và các đối tác kinh doanh đáng tin cậy của chúng tôi",
  "For example, we may share your personal data (including sensitive personal data where permitted) with business partners such as airlines, hotel suppliers, insurance companies and Global Distribution Systems (also known as GDS) to allow you to make travel arrangements and make travel reservations.": "Ví dụ chúng tôi có thể chia sẻ dữ liệu cá nhân của quý khách (bao gồm dữ liệu cá nhân nhạy cảm nếu được phép) với các đối tác kinh doanh như các hãng hàng không, nhà cung cấp khách sạn, công ty bảo hiểm và các Hệ Thống Phân Phối Toàn Cầu (còn gọi là GDS) để cho phép quý khách sắp xếp chuyến du lịch và đặt chỗ chuyến đi.",
  "What we do (our purposes for processing your personal data)": "Những điều chúng tôi làm (mục đích của chúng tôi khi xử lý dữ liệu cá nhân của quý khách)",
  "Our legal basis": "Cơ sở pháp lý của chúng tôi",
  "Storage time": "Thời gian lưu trữ",
  "Allows you to support the product services you have requested from us (i.e. booking travel services mediated by us, as well as providing our own services).": "Cho phép hỗ trợ chăm sóc dịch vụ sản phẩm mà quý khách đã yêu cầu từ chúng tôi (nghĩa là đặt các dịch vụ du lịch do chúng tôi làm trung gian, cũng như cung cấp các dịch vụ riêng của chúng tôi).",
  "Perform our contract with you": "Thực hiện hợp đồng của chúng tôi với quý khách",
  "Where you have provided us with sensitive personal data, consent is the legal basis.": "Khi quý khách đã cung cấp cho chúng tôi dữ liệu cá nhân nhạy cảm thì sự chấp thuận chính là cơ sở pháp lý.",
  "3 years from date of purchase": "3 năm kể từ ngày mua",
  "Consent to the processing of sensitive personal data can be withdrawn at any time.": "Sự chấp thuận cho phép xử lý dữ liệu cá nhân nhạy cảm có thể được rút lại bất cứ lúc nào.",
  "If you have chosen to create a user account on our website, we will provide that account to you": "Nếu quý khách đã chọn tạo tài khoản người dùng trên trang web của chúng tôi, chúng tôi sẽ cung cấp tài khoản đó cho quý khách",
  "Your account includes access to your previously purchased product warranty information": "Tài khoản bao gồm quyền truy cập vào thông tin về việc bảo hành thông tin sản phẩm mua trước đó của quý khách",
  "We will also store your username and password.": "Chúng tôi cũng sẽ lưu trữ tên người dùng và mật khẩu của quý khách.",
  "Perform our contract with you.": "Thực hiện hợp đồng của chúng tôi với quý khách.",
  "Your user account data, as well as personal information related to product and service orders, will be saved until you decide to cancel your user account through our website.": "Dữ liệu tài khoản người dùng của bạn, cũng như thông tin cá nhân liên quan đến đơn hàng sản phẩm và dịch vụ, sẽ được lưu cho đến khi quý khách quyết định hủy tài khoản người dùng thông qua trang web của chúng tôi.",
  "If you have started the warranty registration process, but have not completed it, we may send you an email with a link back to search results, or a booking that has already started, depending on when that your booking process on the website has been interrupted.": "Nếu quý khách đã bắt đầu quá trình đăng ký bảo hành, nhưng chưa hoàn tất, chúng tôi có thể gửi cho quý khách một email có liên kết quay lại kết quả tìm kiếm, hoặc đặt chỗ đã bắt đầu, tùy thuộc vào thời điểm mà quá trình đặt chỗ của quý khách trên trang web đã bị gián đoạn.",
  "Our legitimate interest is to conduct business and allow you to complete your purchase without having to fill in all the information again": "Lợi ích hợp pháp của chúng tôi là thực hiện kinh doanh và cho phép quý khách hoàn tất giao dịch mua của mình mà không phải điền lại tất cả thông tin",
  "If you do not want to receive these emails, you can opt out at any time within the email.": "Nếu quý khách không muốn nhận những email này, quý khách có thể chọn không nhận bất cứ lúc nào trong email.",
  "Long-term storage.": "Lưu trữ dài hạn.",
  "Record calls for quality assurance purposes and to serve any future requests or inquiries you may have.": "Ghi âm lại các cuộc gọi nhằm mục đích đảm bảo chất lượng và phục vụ bất kỳ yêu cầu hoặc thắc mắc nào trong tương lai của quý khách.",
  "Our legitimate interests are (i) to improve our services through internal education and (ii) to deal with your possible requests or complaints": "Lợi ích hợp pháp của chúng tôi là (i) cải thiện dịch vụ của chúng tôi thông qua giáo dục nội bộ và (ii) giải quyết các yêu cầu hoặc khiếu nại có thể có của quý khách",
  "If you do not want calls to be recorded, you can refuse recording before the recording begins.": "Nếu quý khách không muốn các cuộc gọi bị ghi âm, quý khách có thể từ chối việc ghi âm trước khi quá trình ghi âm bắt đầu.",
  "6 months from the date of the phone call": "6 tháng kể từ ngày gọi điện thoại",
  "Only a limited number of people have access to your recordings.": "Chỉ có một số lượng người hạn chế có quyền truy cập bản ghi âm của quý khách.",
  "Use cookies to, for example, improve the usability of this site, provide a personalized experience and collect usage statistics": "Sử dụng cookie để, ví dụ, cải thiện tính khả dụng của trang web này, cung cấp trải nghiệm được cá nhân hóa và thu thập số liệu thống kê sử dụng",
  "We also use session cookies to improve the security of this site.": "Chúng tôi cũng sử dụng cookie phiên làm việc để cải thiện tính bảo mật của trang web này.",
  "Our legitimate interests are (i) to improve our website, (ii) to show you offers that are of interest to you and (iii) to have a safe provision of services and website full": "Lợi ích hợp pháp của chúng tôi là (i) cải thiện trang web của chúng tôi, (ii) hiển thị cho quý khách các đề xuất mà quý khách quan tâm và (iii) có hoạt động cung cấp dịch vụ và trang web an toàn",
  "If you do not want us to store cookies on your computer, you can change the settings in your browser at any time.": "Nếu quý khách không muốn chúng tôi lưu trữ cookie trên máy tính của quý khách, quý khách có thể thay đổi cài đặt trong trình duyệt bất cứ lúc nào.",
  "Depends on the type of cookie.": "Tùy thuộc vào loại cookie.",
  "Partners will be solely responsible for the processing of your personal data once received from us, meaning you must contact the partner in question with any related requests. to your rights under applicable data protection laws": "Các đối tác sẽ tự chịu trách nhiệm về hoạt động xử lý dữ liệu cá nhân của quý khách sau khi nhận được từ chúng tôi, nghĩa là quý khách phải liên hệ với đối tác được đề cập khi có bất kỳ yêu cầu nào liên quan đến quyền của quý khách theo luật bảo vệ dữ liệu hiện hành",
  "We recommend that you read their partners' respective privacy policies for information about how they process your personal data.": "Chúng tôi khuyên quý khách nên đọc các chính sách quyền riêng tư tương ứng của đối tác để biết thông tin về cách họ xử lý dữ liệu cá nhân của quý khách.",
  "We will also share your personal data with other companies (so-called “data processors”) necessary to provide the services you request, e.g. provide call center operator services and our other suppliers and vendors who process your personal data when providing their services to us (e.g. external storage ).": "Chúng tôi cũng sẽ chia sẻ dữ liệu cá nhân của quý khách với các công ty khác (được gọi là “các đơn vị xử lý dữ liệu”) cần thiết để cung cấp các dịch vụ quý khách yêu cầu, ví dụ như các nhà cung cấp dịch vụ điều hành các tổng đài và các nhà cung cấp và bên bán khác của chúng tôi, họ sẽ xử lý dữ liệu cá nhân của quý khách khi cung cấp dịch vụ của họ cho chúng tôi (ví dụ như bộ nhớ ngoài).",
  "Please note that our website contains links to other websites and offers content from third party providers": "Xin lưu ý rằng trang web của chúng tôi chứa các liên kết đến các trang web khác và cung cấp nội dung từ các nhà cung cấp bên thứ ba",
  "This privacy policy applies only to our website and services": "Chính sách quyền riêng tư này chỉ áp dụng cho trang web và các dịch vụ của chúng tôi",
  "When you click on links to other websites or use third party services and products, you should read their privacy policies": "Khi quý khách nhấp vào các liên kết đến các trang web khác hoặc sử dụng các dịch vụ và sản phẩm của bên thứ ba, quý khách nên đọc các chính sách quyền riêng tư của họ",
  "Additionally, if you choose to contact us via social media, this privacy policy will not apply to any personal data submitted by you as part of the contact process. - in this case, we advise you to read the privacy policy of that social media provider.": "Ngoài ra, nếu quý khách chọn liên hệ với chúng tôi qua phương tiện truyền thông xã hội thì chính sách quyền riêng tư này sẽ không áp dụng cho bất kỳ dữ liệu cá nhân nào do quý khách gửi như một phần của quá trình liên hệ - trong trường hợp này, chúng tôi khuyên quý khách nên đọc chính sách quyền riêng tư của nhà cung cấp phương tiện truyền thông xã hội đó.",
  "Under applicable data protection laws, you have certain rights as a “data subject”": "Theo luật bảo vệ dữ liệu hiện hành, quý khách có một số quyền nhất định với tư cách là “đối tượng dữ liệu”",
  "Below we have listed your rights": "Dưới đây, chúng tôi đã liệt kê các quyền của quý khách",
  "Your rights include:": "Các quyền của quý khách bao gồm:",
  "Access rights": "Quyền truy cập",
  "You have the right to access the personal data we process": "Quý khách có quyền truy cập dữ liệu cá nhân mà chúng tôi xử lý",
  "You are also entitled to receive certain information about what we do with your personal data": "Quý khách cũng được quyền nhận các thông tin nhất định về những điều chúng tôi làm với dữ liệu cá nhân",
  "This information is provided in this document.": "Những thông tin này được cung cấp trong tài liệu này.",
  "Right to amend": "Quyền sửa đổi",
  "In certain cases, you have the right to have inaccurate personal data relating to you corrected and to have incomplete personal data completed": "Trong một số trường hợp nhất định, quý khách có quyền sửa các dữ liệu cá nhân không chính xác liên quan đến quý khách và hoàn thành các dữ liệu cá nhân chưa đầy đủ",
  "Please note that we may not be able to correct inaccurate personal data provided by you due to, for example, airline rules and that such a particular change may incur costs.": "Xin lưu ý rằng chúng tôi có thể không sửa được dữ liệu cá nhân không chính xác do quý khách cung cấp do, ví dụ: các quy tắc của hãng hàng không và rằng sự thay đổi cụ thể đó có thể làm phát sinh chi phí.",
  "Right to deletion": "Quyền xóa bỏ",
  "In certain cases, you have the right to have your personal data erased": "Trong một số trường hợp nhất định, quý khách có quyền xóa dữ liệu cá nhân của mình",
  "This is called the “right to be forgotten”.": "Đây được gọi là “quyền được quên”.",
  "Right to restriction of processing": "Quyền hạn chế xử lý",
  "In certain circumstances, you have the right to restrict how we use your personal data.": "Trong một số trường hợp nhất định, quý khách có quyền hạn chế cách chúng tôi sử dụng dữ liệu cá nhân của quý khách.",
  "Right to data portability": "Quyền di chuyển dữ liệu",
  "You have the right to receive your personal data (or to have your personal data transmitted directly to another data controller) in a structured, commonly used and readable format I.": "Quý khách có quyền nhận dữ liệu cá nhân của mình (hoặc để dữ liệu cá nhân được truyền trực tiếp đến một đơn vị kiểm soát dữ liệu khác) theo định dạng có cấu trúc, thường được sử dụng và có thể đọc được từ chúng tôi.",
  "Right to object": "Quyền phản đối",
  "You have the right to object to certain types of processing of your personal data that we carry out": "Quý khách có quyền phản đối một số loại hình xử lý dữ liệu cá nhân mà chúng tôi thực hiện",
  "This applies to all activities based on our \"legitimate interests\".": "Điều này áp dụng cho tất cả các hoạt động dựa trên \"lợi ích hợp pháp\" của chúng tôi.",
  "Finally, you also have the right to complain to the applicable data protection supervisory authority.": "Cuối cùng, quý khách cũng có quyền khiếu nại với cơ quan giám sát bảo vệ dữ liệu hiện hành.",
  "A cookie is a small text file that is stored on your computer, some only until you close your browser (also called “temporary cookies”) and some are stored for longer periods of time. (so-called “persistent cookies”)": "Cookie là một tập tin văn bản nhỏ được lưu trữ trên máy tính của quý khách, một số chỉ lưu cho đến khi quý khách đóng trình duyệt (còn gọi là “cookie tạm thời”) và một số được lưu trong khoảng thời gian dài (được gọi là “cookie dài hạn”)",
  "If you do not want to allow cookies to be stored on your computer, you can change the settings in your browser": "Nếu quý khách không muốn cho phép lưu trữ cookie trên máy tính của mình, quý khách có thể thay đổi cài đặt trong trình duyệt",
  "However, please note that in some cases some of our website features may not function properly and therefore some content may not be displayed correctly.": "Tuy nhiên, xin lưu ý rằng trong một số trường hợp, một số tính năng trang web của chúng tôi có thể không hoạt động đúng cách và do đó một số nội dung có thể không được hiển thị chính xác.",
  "This site uses cookies for a number of reasons, including to provide a personalized experience, to improve the usability of this site and to collect usage statistics": "Trang web này sử dụng cookie vì một số lý do, bao gồm cả việc cung cấp trải nghiệm được cá nhân hóa, để cải thiện tính khả dụng của trang web này và để thu thập số liệu thống kê sử dụng",
  "We also use temporary cookies to improve the security of this site.": "Chúng tôi cũng sử dụng cookie tạm thời để cải thiện tính bảo mật của trang web này.",
  "In some cases when we use cookies, we share data with third parties": "Trong một số trường hợp khi sử dụng cookie, chúng tôi chia sẻ dữ liệu với các bên thứ ba",
  "For example, we use Google Analytics and Google AdWords, services that transmit website traffic data to Google servers": "Ví dụ, chúng tôi sử dụng Google Analytics và Google AdWords, các dịch vụ truyền dữ liệu lưu lượng truy cập trang web đến các máy chủ của Google",
  "Google Analytics does not identify individual users and does not associate your IP address with any other data held by Google": "Google Analytics không nhận dạng người dùng cá nhân và không liên kết địa chỉ IP của quý khách với bất kỳ dữ liệu nào khác do Google lưu giữ",
  "We use reports provided by Google to understand more about site traffic and site usage and optimize ads purchased from Google's own network and other advertising networks": "Chúng tôi sử dụng các báo cáo do Google cung cấp để hiểu thêm về lưu lượng truy cập trang web và việc sử dụng trang web đồng thời tối ưu hóa các quảng cáo mua từ mạng riêng của Google và mạng lưới quảng cáo khác",
  "Google may process data in the manner described in the Google Privacy Policy and for the purposes set out above in this section": "Google có thể xử lý dữ liệu theo cách được mô tả trong Chính Sách Quyền Riêng Tư của Google và cho các mục đích được nêu ở trên trong phần này",
  "You may choose to use Google Analytics if you disable or decline cookies, disable JavaScript, or use an opt-out service provided by Google.": "Quý khách có thể chọn sử dụng Google Analytics nếu quý khách vô hiệu hóa hoặc từ chối cookie, vô hiệu hóa JavaScript hoặc sử dụng dịch vụ chọn không sử dụng do Google cung cấp.",
  "Our website also uses the Facebook pixel - it collects anonymous aggregated data that helps us optimize advertising purchases across Facebook's various platforms (including Instagram)": "Trang web của chúng tôi cũng sử dụng pixel Facebook - nó thu thập dữ liệu tổng hợp ẩn danh giúp chúng tôi tối ưu hóa việc mua quảng cáo trên các nền tảng khác nhau của Facebook (bao gồm Instagram)",
  "Facebook collects a user id so they match if the user has visited a website with a Facebook pixel": "Facebook thu thập một id người dùng để chúng khớp nhau nếu người dùng đã truy cập một trang web có pixel Facebook",
  "However, we as advertisers can never identify the behavior of a particular user": "Tuy nhiên, chúng tôi với tư cách là nhà quảng cáo không bao giờ có thể nhận dạng hành vi của một người dùng cụ thể",
  "Facebook and its related platforms are part of a closed advertising ecosystem where their users can regulate if they consent to advertisers using data collected from their sites to buy ads. report on Facebook.": "Facebook và các nền tảng liên quan của Facebook nằm trong hệ sinh thái quảng cáo khép kín nơi người dùng chúng có thể điều chỉnh nếu họ chấp thuận cho các nhà quảng cáo sử dụng dữ liệu được thu thập từ trang web của họ để mua quảng cáo trên Facebook.",
  "Furthermore, our website uses conversion tracking scripts and cookies from Bing, ... (you can view their privacy policy using the following links)": "Hơn nữa, trang web của chúng tôi sử dụng các dòng lệnh theo dõi chuyển đổi và cookie từ Bing, ... (quý khách có thể xem chính sách quyền riêng tư của họ bằng các liên kết sau)",
  "All of these services collect aggregate statistical data that helps us optimize advertising purchases": "Tất cả các dịch vụ này đều thu thập dữ liệu thống kê tổng hợp giúp chúng tôi tối ưu hóa việc mua quảng cáo",
  "We as advertisers cannot identify a single user using this data": "Chúng tôi với tư cách là nhà quảng cáo không thể nhận dạng một người dùng đơn lẻ sử dụng dữ liệu này",
  "You can disable the use of cookies in your browser settings.": "Quý khách có thể tắt sử dụng cookie trong cài đặt trình duyệt của mình.",
  "To keep your personal data secure, we have implemented a number of technical and organizational security measures": "Để giữ an toàn cho dữ liệu cá nhân của quý khách, chúng tôi đã triển khai một số biện pháp bảo mật kỹ thuật và có tổ chức",
  "For example, we maintain high levels of technical security in all systems (including traceability, data disaster recovery, access restrictions, ...)": "Ví dụ, chúng tôi duy trì các mức độ bảo mật kỹ thuật cao trong tất cả các hệ thống (bao gồm truy xuất nguồn gốc, khôi phục dữ liệu sau thảm họa, hạn chế truy cập, ...)",
  "Additionally, we have put in place policies to ensure that our employees (subject of course to confidentiality obligations) do not use personal data unnecessarily": "Ngoài ra, chúng tôi đã áp dụng các chính sách để đảm bảo rằng nhân viên của mình (tất nhiên phải tuân theo nghĩa vụ bảo mật) không sử dụng dữ liệu cá nhân khi không cần thiết",
  "Such policies also set out our standards when we contract with suppliers or introduce new IT systems within our operations.": "Các chính sách như vậy cũng đặt ra các tiêu chuẩn của chúng tôi khi chúng tôi ký hợp đồng với các nhà cung cấp hoặc giới thiệu các hệ thống CNTT mới trong các hoạt động của chúng tôi.",
  "How to contact us": "Cách liên hệ với chúng tôi",
  "If you have any questions regarding our processing of your personal data or our use of cookies, or if you wish to raise any of your rights under data protection law current, please send an email to: trind@devhongzui.com or contact directly.": "Nếu quý khách có bất kỳ câu hỏi nào liên quan đến việc xử lý dữ liệu cá nhân của quý khách hoặc việc sử dụng cookie của chúng tôi, hoặc nếu quý khách muốn nêu lên bất kỳ quyền nào của mình theo luật bảo vệ dữ liệu hiện hành, vui lòng gửi email đến: trind@devhongzui.com hoặc liên hệ trực tiếp.",
  "Privacy policy changes": "Các thay đổi về chính sách quyền riêng tư",
  "Where we change the way we process your personal data or use cookies, we will promptly update this privacy policy and publish it on this website.": "Trường hợp chúng tôi thay đổi cách xử lý dữ liệu cá nhân của quý khách hoặc cách sử dụng cookie, chúng tôi sẽ cập nhật kịp thời chính sách quyền riêng tư này và công bố chính sách đó trên trang web này."
}
