{
  "translation": {
    "Toggle navigation": "Chuyển đổi điều hướng",
    "Logo": "Biểu tượng",
    "Courses": "Khóa học",
    "Tools": "Công cụ",
    "Musics": "Âm nhạc",
    "Search": "Tìm kiếm",
    "Theme": "Giao diện",
    "Language": "Ngôn ngữ",
    "Login": "Đăng nhập",
    "Signup": "Đăng ký",
    "See more": "Xem thêm",
    "Contact": "Liên hệ",
    "About me": "Giới thiệu",
    "Privacy policy": "Chính sách quyền riêng tư",
    "Security policy": "Chính sách bảo mật",
    "Other projects": "Dự án khác",
    "Magento Project": "Dự án Magento",
    "NodeJs Project": "Dự án NodeJs",
    "Subscribe to our newsletter": "Theo dõi bản tin của chúng tôi",
    "Monthly digest of what's new and exciting from us.": "Thông báo hàng tháng về những gì mới và thú vị từ chúng tôi.",
    "Email address": "Địa chỉ email",
    "Subscribe": "Đăng ký",
    "Responsible for the content": "Chịu trách nhiệm về nội dung",
    "No. 8, My A Street, Dong My, Thanh Tri, City. Hanoi": "Số 8. đường Mỹ Ả, Đông Mỹ, Thanh Trì, Hà Nội",
    "Address detail": "Chi tiết địa chỉ",
    "Phone number": "Số điện thoại",
    "Email": "Thư điện tử",
    "Hello, I am Tri Nguyen Duc": "Xin chào, tôi là Nguyễn Đức Trí",
    "I love the Information Technology field and have a passion for Web Programming.": "Tôi yêu thích lĩnh vực Công nghệ thông tin và đam mê Lập trình Web.",
    "Overview": "Tổng quan",
    "Personal information": "Thông tin cá nhân",
    "PHP programmer": "Lập trình viên PHP",
    "Am a software developer with significant experience in PHP programming": "Là một nhà phát triển phần mềm có kinh nghiệm đáng kể về lập trình PHP",
    "With Laravel, I have the ability to build diverse web applications and manage databases effectively": "Với Laravel, tôi có khả năng xây dựng các ứng dụng web đa dạng và quản lý cơ sở dữ liệu một cách hiệu quả",
    "At the same time, I worked with Magento 2 to customize and develop e-commerce features": "Đồng thời, tôi làm việc với Magento 2 để tùy chỉnh và phát triển các tính năng thương mại điện tử",
    "Full name": "Họ & tên",
    "Home town": "Quê quán",
    "Hanoi, Vietnam": "Hà Nội, Việt Nam",
    "Socials": "Mạng xã hội",
    "Project": "Dự án",
    "Type": "Loại",
    "Enterprise": "Doanh nghiệp",
    "Individual": "Cá nhân",
    "Technology": "Công nghệ",
    "Introduce": "Giới thiệu",
    "Genki Sushi Hong Kong bestsellers comprise sushi, sashimi, light foods, hot dishes, desserts and kids": "Genki Sushi Hồng Kông bán chạy nhất bao gồm sushi, sashimi, đồ ăn nhẹ, món nóng, món tráng miệng và đồ ăn trẻ em",
    "Galle Genuine Watch System is gradually increasing its position as the number 1 watch distributor in Vietnam": "Hệ thống Đồng hồ Chính hãng Galle đang dần nâng cao vị thế là nhà phân phối đồng hồ số 1 tại Việt Nam",
    "Shop thousands products (beauty, clothing, lifestyle) and order takeaway foods from Lee Gardens": "Mua sắm hàng ngàn sản phẩm (sắc đẹp, quần áo, phong cách sống) và đặt mua đồ ăn mang đi từ Lee Gardens",
    "ROUTINE is a famous, high-end fashion clothing brand in Vietnam, specializing in genuine everyday wear": "ROUTINE là thương hiệu quần áo thời trang cao cấp, nổi tiếng tại Việt Nam, chuyên quần áo hàng ngày chính hãng",
    "Practice CRUD, Authentication, OAuth operations on Laravel with MySQL Database": "Thực hành các thao tác CRUD, Authentication, OAuth trên Laravel với MySQL Database",
    "Get familiar with Back-end development using NodeJs, MongoDB, GraphQL. Deploy the project on the Product environment (Ubuntu)": "Làm quen với việc phát triển Back-end bằng NodeJs, MongoDB, GraphQL. Triển khai dự án trên môi trường Product (Ubuntu)",
    "Quick view": "Xem nhanh",
    "Business": "Doanh nghiệp",
    "Powerful, flexible e-commerce platform": "Nền tảng thương mại điện tử mạnh mẽ, linh hoạt",
    "Powerful web application development framework": "Khung phát triển ứng dụng web mạnh mẽ",
    "Reliable and flexible web development framework": "Khung phát triển web đáng tin cậy và linh hoạt",
    "JavaScript library that optimizes DOM processing": "Thư viện JavaScript tối ưu hóa xử lý DOM",
    "High-performance server-side JavaScript code execution environment": "Môi trường thực thi mã JavaScript phía máy chủ hiệu suất cao",
    "Popular, open source database management system": "Hệ thống quản lý cơ sở dữ liệu mã nguồn mở phổ biến",
    "NoSQL database management system, flexible JSON storage": "Hệ thống quản lý cơ sở dữ liệu NoSQL, lưu trữ JSON linh hoạt",
    "Flexible and efficient data query language": "Ngôn ngữ truy vấn dữ liệu linh hoạt và hiệu quả",
    "A JavaScript library used to build flexible and efficient user interfaces.": "Thư viện JavaScript dùng để xây dựng giao diện người dùng linh hoạt và hiệu quả.",
    "Programming framework": "Khung giao diện lập trình",
    "Library": "Thư viện",
    "Database": "Cơ sở dữ liệu",
    "Others": "Khác",
    "Personal skills": "Kỹ năng bản thân",
    "Web Development": "Phát triển Web",
    "Use experience handling Framework, Library Back-End and Front-End in designing, deploying and maintaining Website and Webapp": "Sử dụng kinh nghiệm xử lý Framework, Library Back-End và Front-End trong thiết kế, triển khai, bảo trì Website, Webapp",
    "Database Optimization": "Tối ưu Cơ sở dữ liệu",
    "Provide solutions for data management and system monitoring": "Đưa ra giải pháp về quản lý dữ liệu và giám sát hệ thống",
    "Report data security risks and remediate known security vulnerabilities": "Báo cáo các rủi ro an toàn dữ liệu và khắc phục các lỗ hổng bảo mật đã biết",
    "Server Deployment": "Triển khai Máy chủ",
    "Create, maintain, upgrade Cloud VPS servers and support Hosting solutions for small and medium businesses.": "Khởi tạo, bảo trì, nâng cấp máy chủ Cloud VPS và hỗ trợ giải pháp Hosting cho doanh nghiệp vừa và nhỏ."
  }
}
