{
    "Welcome": "Chào mừng",
    "Courses": "Khóa học",
    "Course": "Khóa học",
    "Subjects": "Môn học",
    "Subject": "Môn học",
    "Lessons": "Bài học",
    "Lesson": "Bài học",
    "Channels": "Kênh",
    "Channel": "Kênh",
    "Thumbnails": "Hình thu nhỏ",
    "Thumbnail": "Hình thu nhỏ",
    "Tools": "Công cụ",
    "Musics": "Âm nhạc",
    "Comment": "Bình luận",
    "Theme": "Giao diện",
    "Language": "Ngôn ngữ",
    "Search": "Tìm kiếm",
    "Login": "Đăng nhập",
    "Register": "Đăng ký",
    "Reset password": "Đặt lại mật khẩu",
    "Verify email": "Xác thực Thư điện tử",
    "Verification email has been sent": "Thư xác thực đã được gửi đến",
    "Please check your Inbox or": "Vui lòng kiểm tra Hộp thư đến hoặc",
    "click here to try again": "nhấp vào đây để thử lại",
    "The account has previously authenticated email": "Tài khoản đã xác thực thư điện tử trước đó",
    "Authentication mail has been sent!": "Thư xác thực đã được gửi đi!",
    "Extend": "Mở rộng",
    "devhongzui.com - Collection of tools and APIs to support programming for IT students in Vietnam": "devhongzui.com - Tổng hợp công cụ, API hỗ trợ lập trình cho sinh viên CNTT Việt Nam",
    "Explore rich resources and diverse utilities to develop your programming skills": "Khám phá tài nguyên phong phú và tiện ích đa dạng để phát triển kỹ năng lập trình của bạn",
    "Find out now!": "Tìm hiểu ngay!",
    "Connect": "Kết nối",
    "Social network :name": "Mạng xã hội :name",
    "Designed by": "Thiết kế bởi",
    "Contact": "Liên hệ",
    "About me": "Giới thiệu",
    "Privacy Policy": "Chính sách Quyền riêng tư",
    "Security Policy": "Chính sách Bảo mật",
    "Responsible for the content": "Chịu trách nhiệm về nội dung",
    "Address detail": "Chi tiết địa chỉ",
    "Country": "Quốc gia",
    "Phone number": "Số điện thoại",
    "Email": "Thư điện tử",
    "No. 8, My A Street, Dong My, Thanh Tri, City. Hanoi": "Số 8. đường Mỹ Ả, Đông Mỹ, Thanh Trì, Hà Nội",
    "Hello, I am :name": "Xin chào, tôi là :name",
    "I love the Information Technology field and have a passion for Web Programming.": "Tôi yêu thích lĩnh vực Công nghệ thông tin và đam mê Lập trình Web.",
    "Overview": "Tổng quan",
    "Personal information": "Thông tin cá nhân",
    "PHP programmer": "Lập trình viên PHP",
    "Am a software developer with significant experience in PHP programming.": "Là một nhà phát triển phần mềm có kinh nghiệm đáng kể về lập trình PHP.",
    "With Laravel, I have the ability to build diverse web applications and manage databases effectively.": "Với Laravel, tôi có khả năng xây dựng các ứng dụng web đa dạng và quản lý cơ sở dữ liệu một cách hiệu quả.",
    "At the same time, I worked with Magento 2 to customize and develop e-commerce features.": "Đồng thời, tôi làm việc với Magento 2 để tùy chỉnh và phát triển các tính năng thương mại điện tử.",
    "Full name": "Họ & tên",
    "Home town": "Quê quán",
    "Hanoi, Vietnam": "Hà Nội, Việt Nam",
    "Socials": "Mạng xã hội",
    "Project": "Dự án",
    "Enterprise": "Doanh nghiệp",
    "Individual": "Cá nhân",
    "Type": "Loại",
    "Technology": "Công nghệ",
    "Introduce": "Giới thiệu",
    "Quick view": "Xem nhanh",
    "Genki Sushi Hong Kong bestsellers comprise sushi, sashimi, light foods, hot dishes, desserts and kids": "Genki Sushi Hồng Kông bán chạy nhất bao gồm sushi, sashimi, đồ ăn nhẹ, món nóng, món tráng miệng và đồ ăn trẻ em",
    "Galle Genuine Watch System is gradually increasing its position as the number 1 watch distributor in Vietnam": "Hệ thống Đồng hồ Chính hãng Galle đang dần nâng cao vị thế là nhà phân phối đồng hồ số 1 tại Việt Nam",
    "Shop thousands products (beauty, clothing, lifestyle) and order takeaway foods from Lee Gardens": "Mua sắm hàng ngàn sản phẩm (sắc đẹp, quần áo, phong cách sống) và đặt mua đồ ăn mang đi từ Lee Gardens",
    "ROUTINE is a famous, high-end fashion clothing brand in Vietnam, specializing in genuine everyday wear": "ROUTINE là thương hiệu quần áo thời trang cao cấp, nổi tiếng tại Việt Nam, chuyên quần áo hàng ngày chính hãng",
    "Practice CRUD, Authentication, OAuth operations on Laravel with MySQL Database": "Thực hành các thao tác CRUD, Authentication, OAuth trên Laravel với MySQL Database",
    "Get familiar with Back-end development using NodeJs, MongoDB, GraphQL. Deploy the project on the Product environment (Ubuntu)": "Làm quen với việc phát triển Back-end bằng NodeJs, MongoDB, GraphQL. Triển khai dự án trên môi trường Product (Ubuntu)",
    "Business": "Doanh nghiệp",
    "Programming framework": "Khung giao diện lập trình",
    "Library": "Thư viện",
    "Database": "Cơ sở dữ liệu",
    "Others": "Khác",
    "Powerful, flexible e-commerce platform": "Nền tảng thương mại điện tử mạnh mẽ, linh hoạt",
    "Powerful web application development framework": "Khung phát triển ứng dụng web mạnh mẽ",
    "Reliable and flexible web development framework": "Khung phát triển web đáng tin cậy và linh hoạt",
    "JavaScript library that optimizes DOM processing": "Thư viện JavaScript tối ưu hóa xử lý DOM",
    "High-performance server-side JavaScript code execution environment": "Môi trường thực thi mã JavaScript phía máy chủ hiệu suất cao",
    "Popular, open source database management system": "Hệ thống quản lý cơ sở dữ liệu mã nguồn mở phổ biến",
    "NoSQL database management system, flexible JSON storage": "Hệ thống quản lý cơ sở dữ liệu NoSQL, lưu trữ JSON linh hoạt",
    "Flexible and efficient data query language": "Ngôn ngữ truy vấn dữ liệu linh hoạt và hiệu quả",
    "Personal skills": "Kỹ năng bản thân",
    "Web Development": "Phát triển Web",
    "Use experience handling Framework, Library Back-End and Front-End in designing, deploying and maintaining Website and Webapp": "Sử dụng kinh nghiệm xử lý Framework, Library Back-End và Front-End trong thiết kế, triển khai, bảo trì Website, Webapp",
    "Database Optimization": "Tối ưu Cơ sở dữ liệu",
    "Provide solutions for data management and system monitoring.": "Đưa ra giải pháp về quản lý dữ liệu và giám sát hệ thống.",
    "Report data security risks and remediate known security vulnerabilities.": "Báo cáo các rủi ro an toàn dữ liệu và khắc phục các lỗ hổng bảo mật đã biết.",
    "Ecommerce": "Thương mại điện tử",
    "Create a roadmap for product and customer data management.": "Lên lộ trình về quản lý dữ liệu sản phẩm, khách hàng.",
    "Consulting and proposing solutions to team members.": "Tư vấn, đề xuất giải pháp với các thành viên trong đội ngũ.",
    "Table of contents": "Mục lục",
    "Collect personal information": "Thu thập thông tin cá nhân",
    "Other regulations regarding personal information": "Điều lệ khác về thông tin cá nhân",
    "Competition": "Cuộc thi",
    "Third Partners and Affiliates": "Đối tác thứ ba và Liên kết",
    "Use of Cookies": "Sử dụng Cookie",
    "Security": "Bảo mật",
    "Customer benefits": "Quyền lợi khách hàng",
    "We will collect a variety of information from you when you want to place an order on the web.": "Chúng tôi sẽ thu thập nhiều thông tin khác nhau của quý khách khi bạn muốn đặt hàng trên web.",
    "We collect, store and process your information for the purchase process and for future communications, and to provide services.": "Chúng tôi thu thập, lưu trữ và xử lý thông tin của bạn cho quá trình mua hàng và cho những thông báo sau này, và để cung cấp dịch vụ.",
    "We do not limit personal information: title, name, gender, date of birth, email, address, delivery address, phone number, fax, payment details, card or debit payment details. Bank account details.": "Chúng tôi không giới hạn thông tin cá nhân: danh hiệu, tên, giới tính, ngày sinh, email, địa chỉ, địa chỉ giao hàng, số điện thoại, fax, chi tiết thanh toán, chi tiết thanh toán bằng thẻ hoặc chi tiết tài khoản ngân hàng.",
    "We will use the information you have provided to process orders, provide services and information requested through the website and according to your requests.": "Chúng tôi sẽ dùng thông tin quý khách đã cung cấp để xử lý đơn đặt hàng, cung cấp các dịch vụ và thông tin yêu cầu thông qua website và theo yêu cầu của bạn.",
    "Furthermore, we will use such information to manage your account; verify and perform online transactions, audit data downloads from the web; improve website layout and content and adapt it to users; Identify visitors to the website, send information including product and service information, if you show no signs of refusal.": "Hơn nữa, chúng tôi sẽ sử dụng các thông tin đó để quản lý tài khoản của bạn; xác minh và thực hiện giao dịch trực tuyến, kiểm toán việc tải dữ liệu từ web; cải thiện bố cục và nội dung trang web và điều chỉnh cho phù hợp với người dùng; nhận diện khách vào web, gửi thông tin bao gồm thông tin sản phẩm và dịch vụ, nếu bạn không có dấu hiệu từ chối.",
    "If you do not want to receive any of our marketing communications, you can opt out at any time.": "Nếu quý khách không muốn nhận bất cứ thông tin tiếp thị của chúng tôi thì có thể từ chối bất cứ lúc nào.",
    "We may pass your name and address to a third party who delivers the goods to you (for example to a courier or supplier).": "Chúng tôi có thể chuyển tên và địa chỉ cho bên thứ ba để họ giao hàng cho bạn (ví dụ cho bên chuyển phát nhanh hoặc nhà cung cấp).",
    "Your order details are kept by us, but for security reasons we cannot make them available directly.": "Chi tiết đơn đặt hàng của bạn được chúng tôi lưu giữ nhưng vì lí do bảo mật nên chúng tôi không công khai trực tiếp được.",
    "However, you can access information by logging into your account on the web.": "Tuy nhiên, quý khách có thể tiếp cận thông tin bằng cách đăng nhập tài khoản trên web.",
    "Here you will see your order details, received and sent products and email, bank and newsletter details for your long-term subscriptions.": "Tại đây, bạn sẽ thấy chi tiết đơn đặt hàng của mình, những sản phẩm đã nhận và những sản phẩm đã gửi và chi tiết email, ngân hàng và bản tin mà bạn đặt theo dõi dài hạn.",
    "You commit to keeping your personal data confidential and are not allowed to disclose it to third parties.": "Quý khách cam kết bảo mật dữ liệu cá nhân và không được phép tiết lộ cho bên thứ ba.",
    "We do not accept any responsibility for password misuse if this is not our fault.": "Chúng tôi không chịu bất kỳ trách nhiệm nào cho việc dùng sai mật khẩu nếu đây không phải lỗi của chúng tôi.",
    "In any competition, we will use data to announce winners and promote offers.": "Trong bất kì cuộc thi nào, chúng tôi sẽ sử dụng dữ liệu để thông báo người chiến thắng và quảng cáo chào hàng.",
    "You can register to participate for more details about the contest.": "Bạn có thể đăng ký tham gia để biết thêm chi tiết về cuộc thi.",
    "A cookie is a small text file that can identify a unique username from your computer to our server when you visit certain pages on the website and will be saved by your internet browser on your hard drive. your personality.": "Cookie là tập tin văn bản nhỏ có thể nhận dạng tên truy cập duy nhất từ máy tính của bạn đến máy chủ của chúng tôi khi bạn truy cập vào các trang nhất định trên website và sẽ được lưu bởi trình duyệt internet lên ổ cứng máy tính của bạn.",
    "Cookies are used to identify IP addresses and save time.": "Cookie được dùng để nhận dạng địa chỉ IP, lưu lại thời gian.",
    "We use cookies for your convenience on the website (for example, remembering your username when you want to change your shopping cart again without having to re-enter your email address) and do not require any information. about you (for example, targeted advertising).": "Chúng tôi dùng cookie để tiện cho quý khách vào web (ví dụ: ghi nhớ tên truy cập khi bạn muốn vào thay đổi lại giỏ mua hàng mà không cần phải nhập lại địa chỉ email của mình) và không đòi hỏi bất kỳ thông tin nào về bạn (ví dụ: mục tiêu quảng cáo).",
    "Your browser can be set not to use cookies, but this will limit your access to the web.": "Trình duyệt của bạn có thể được thiết lập không sử dụng cookie nhưng điều này sẽ hạn chế quyền sử dụng của bạn trên web.",
    "Please accept our commitment that cookies do not include any private personal details and are safe from viruses.": "Xin vui lòng chấp nhận cam kết của chúng tôi là cookie không bao gồm bất cứ chi tiết cá nhân riêng tư nào và an toàn với virus.",
    "This browser uses Google Analytics, a web analytics service provided by Google, Inc.": "Trình duyệt này sử dụng Google Analytics, một dịch vụ phân tích web được cung cấp bởi Google, Inc.",
    "Google Analytics uses cookies, which are text files placed on computers, to help the website analyze how users use the website.": "Google Analytics dùng cookie, là những tập tin văn bản đặt trong máy tính để giúp website phân tích người dùng vào web như thế nào.",
    "Google will use this information to evaluate your use of the website, compile reports on website activities for website operators and provide other services related to internet activities and internet usage.": "Google sẽ dùng thông tin này để đánh giá cách dùng web của bạn, lập báo cáo về các hoạt động trên web cho các nhà khai thác web và cung cấp các dịch vụ khác liên quan đến các hoạt động internet và cách dùng internet.",
    "Google may also transfer this information to third parties as required by law or to third parties who process the information on Google's behalf.": "Google cũng có thể chuyển giao thông tin này cho bên thứ ba theo yêu cầu của pháp luật hoặc các bên thứ ba xử lý thông tin trên danh nghĩa của Google.",
    "Google will not combine your IP address with any other data it holds. You can refuse the use of cookies by selecting the appropriate settings on your browser, however please note that this will prevent you from fully using the functionality of the website.": "Google sẽ không kết hợp địa chỉ IP của bạn với bất kỳ dữ liệu nào khác mà Google đang giữ. Quý khách có thể từ chối dùng cookie bằng cách chọn các thiết lập thích hợp trên trình duyệt của mình, tuy nhiên lưu ý rằng điều này sẽ ngăn bạn sử dụng triệt để chức năng của website.",
    "By using this website, you consent to Google processing data about you in the manner and for the purposes set out above.": "Bằng cách sử dụng trang web này, bạn đã đồng ý cho Google xử lý dữ liệu về bạn theo cách thức và các mục đích nêu trên.",
    "This Privacy Policy explains how we receive, use and (in certain circumstances) disclose your personal information. The policy will also explain the steps we take to secure our customers' personal information.": "Chính sách bảo mật sẽ giải thích cách chúng tôi tiếp nhận, sử dụng và (trong trường hợp nào đó) tiết lộ thông tin cá nhân của bạn. Chính sách cũng sẽ giải thích các bước chúng tôi thực hiện để bảo mật thông tin cá nhân của khách hàng.",
    "Finally, the Privacy Policy explains your choices regarding the collection, use and disclosure of your personal information.": "Cuối cùng, Chính sách bảo mật sẽ giải thích quyền lựa chọn của quý khách về việc thu thập, sử dụng và tiết lộ thông tin cá nhân của mình.",
    "Protecting personal data and building customer trust is a very important issue for us.": "Bảo vệ dữ liệu cá nhân và gây dựng được niềm tin cho quý khách là vấn đề rất quan trọng với chúng tôi.",
    "Therefore, we will use your name and other information related to you in accordance with the content of the Privacy Policy.": "Vì vậy, chúng tôi sẽ dùng tên và các thông tin khác liên quan đến quý khách tuân thủ theo nội dung của Chính sách bảo mật.",
    "We only collect necessary information related to sales transactions.": "Chúng tôi chỉ thu thập những thông tin cần thiết liên quan đến giao dịch mua bán.",
    "We will keep customer information for as long as required by law or for any other purpose.": "Chúng tôi sẽ giữ thông tin của khách hàng trong thời gian luật pháp quy định hoặc cho mục đích nào đó.",
    "You can access the website and browse without having to provide personal details.": "Quý khách có thể truy cập vào website và trình duyệt mà không cần phải cung cấp chi tiết cá nhân.",
    "At that time, you are anonymous and we cannot know who you are if you are not logged in to your account.": "Lúc đó, bạn đang ẩn danh và chúng tôi không thể biết bạn là ai nếu bạn không đăng nhập vào tài khoản của mình.",
    "We may use your personal information for market research.": "Chúng tôi có thể dùng thông tin cá nhân của bạn để nghiên cứu thị trường.",
    "Details will be hidden and used for statistics only.": "Chi tiết sẽ được ẩn và chỉ được dùng để thống kê.",
    "You can refuse to participate at any time.": "Quý khách có thể từ chối không tham gia bất cứ lúc nào.",
    "Any responses to surveys or opinion polls that we ask you to complete will not be passed on to third parties.": "Bất kỳ câu trả lời cho khảo sát hoặc thăm dò dư luận mà chúng tôi cần bạn làm sẽ không được chuyển cho bên thứ ba.",
    "The only thing necessary is to reveal your email if you want to participate.": "Việc cần thiết duy nhất là tiết lộ email của bạn nếu bạn muốn tham gia.",
    "The response will be saved separately from your email.": "Câu trả lời sẽ được lưu tách riêng với email của bạn.",
    "You will receive information about us, about the website, other websites, products, sales, newsletters, anything related to group companies or business partners.": "Bạn sẽ nhận được thông tin về chúng tôi, về website, các website khác, sản phẩm, doanh số bán hàng, bản tin, bất cứ những gì liên quan đến các công ty nằm trong nhóm hoặc các đối tác kinh doanh.",
    "If you do not want to receive this information, please click on the opt-out link in any email we send you.": "Nếu quý khách không muốn nhận những thông tin này, vui lòng nhấn vào link từ chối trong bất kỳ email chúng tôi gửi cho bạn.",
    "Within 7 days of receiving your instructions, we will stop sending information.": "Trong vòng 7 ngày nhận chỉ dẫn của bạn, chúng tôi sẽ ngừng gửi thông tin.",
    "If it is unclear, we will contact you.": "Nếu thấy không rõ, chúng tôi sẽ liên lạc với bạn.",
    "We will continue to anonymize user data on the website and use it for a variety of purposes, including determining the user's location and usage of certain aspects of the website or links contained in emails. to users and provide that anonymous data to third parties such as publishers.": "Chúng tôi sẽ tiếp tục giấu tên dữ liệu người dùng trên website và sử dụng cho nhiều mục đích khác nhau, bao gồm việc xác định vị trí của người dùng và cách sử dụng các khía cạnh nhất định của website hoặc đường link chứa trong email tới người dùng và cung cấp dữ liệu ẩn danh đó cho bên thứ 3 là nhà xuất bản.",
    "However, this data does not have the ability to identify individuals.": "Tuy nhiên, dữ liệu này không có khả năng xác định cá nhân.",
    "We may pass your information to other companies in the group.": "Chúng tôi có thể chuyển thông tin của quý khách cho các công ty khác trong nhóm.",
    "We may transfer your information to agents and subcontractors within the framework of the Privacy Policy.": "Chúng tôi có thể chuyển thông tin của quý khách cho các đại lý và nhà thầu phụ trong khuôn khổ quy định của Chính sách bảo mật.",
    "For example, we will rely on third parties for delivery, payment collection, data analysis, marketing and customer service support.": "Ví dụ: chúng tôi sẽ nhờ bên thứ ba giao hàng, nhận tiền thanh toán, phân tích dữ liệu, tiếp thị và hỗ trợ dịch vụ khách hàng.",
    "We may exchange information with third parties for the purposes of fraud prevention and credit risk reduction.": "Chúng tôi có thể trao đổi thông tin với bên thứ ba với mục đích chống gian lận và giảm rủi ro tín dụng.",
    "We may transfer our database of your personal information if we sell the whole company or just part of it.": "Chúng tôi có thể chuyển cơ sở dữ liệu gồm thông tin cá nhân của bạn nếu chúng tôi bán cả công ty hoặc chỉ một phần.",
    "Within the framework of the Privacy Policy, we do not sell or disclose your personal data to third parties without your prior consent unless this is necessary for the terms of the Privacy Policy or we are required to do so in accordance with the provisions of the Law.": "Trong khuôn khổ Chính sách bảo mật, chúng tôi không bán hay tiết lộ dữ liệu cá nhân của bạn cho bên thứ ba mà không được đồng ý trước trừ khi điều này là cần thiết cho các điều khoản trong Chính sách bảo mật hoặc chúng tôi được yêu cầu phải làm như vậy theo quy định của Pháp luật.",
    "The Website may include third party advertisements and links to other websites or frames of other websites. Please note that we have no duty to secure the information or content of third parties or other websites, or any third parties to whom we transfer data in accordance with this Privacy Policy.": "Website có thể bao gồm quảng cáo của bên thứ ba và các liên kết đến các trang web khác hoặc khung của các trang web khác. Xin lưu ý rằng chúng tôi không có nhiệm vụ bảo mật thông tin hay nội dung của bên thứ ba hay các website khác, hay bất kỳ bên thứ ba nào mà chúng tôi chuyển giao dữ liệu cho phù hợp với Chính sách bảo mật.",
    "The customer behavior tracking system we use on Display Advertising channels (eg Customer Remarketing, DoubleClick advertising campaign management system, customer preferences with Google tools Analytics...) can collect information such as age, gender, interests and number of interactions with ad appearances.": "Hệ thống theo dõi hành vi của khách hàng được chúng tôi sử dụng trên kênh Hiển Thị Quảng Cáo (ví dụ như Tiếp Thị Lại Khách Hàng, hệ thống quản lý các chiến dịch quảng cáo DoubleClick, sở thích của khách hàng với công cụ Google Analytics…) có thể thu thập được các thông tin như độ tuổi, giới tính, sở thích và số lần tương tác với số lần xuất hiện của quảng cáo.",
    "With the ad settings feature, users or customers can choose to exit the customer behavior tracking feature of Google Analytics and choose how the Ad Display channel appears on Google.": "Với tính năng cài đặt quảng cáo, người dùng hoặc khác hàng có thể lựa chọn thoát ra khỏi tính năng theo dõi hành vi khách hàng của Google Analytics và lựa chọn cách xuất hiện của kênh Hiển Thị Quảng Cáo trên Google.",
    "We and third-party vendors, including Google, may use Google Analytics cookies or third-party cookies (such as DoubleClick) for information collection, optimization and advertising purposes. based on users' past website visits.": "Chúng tôi và các nhà cung cấp bên thứ ba, bao gồm Google, có thể sử dụng cookies của Google Analytics hoặc cookies của bên thứ ba (như DoubleClick) để thu thập thông tin, tối ưu hóa và phục vụ cho mục đích quảng cáo dựa trên lần truy cập website của người dùng trong quá khứ.",
    "You have the right to request access to your personal data, and the right to request us to correct errors in your data without charge.": "Quý khách có quyền yêu cầu truy cập vào dữ liệu cá nhân của mình, có quyền yêu cầu chúng tôi sửa lại những sai sót trong dữ liệu của bạn mà không mất phí.",
    "You have the right at any time to ask us to stop using your personal data for marketing purposes.": "Bất cứ lúc nào bạn cũng có quyền yêu cầu chúng tôi ngưng sử dụng dữ liệu cá nhân của bạn cho mục đích tiếp thị.",
    "We take appropriate technical and security measures to prevent unauthorized or unlawful access or loss or destruction or damage to your information.": "Chúng tôi có biện pháp thích hợp về kỹ thuật và an ninh để ngăn chặn truy cập trái phép hoặc trái pháp luật hoặc mất mát hoặc tiêu hủy hoặc thiệt hại cho thông tin của bạn.",
    "When we crawl the web, we collect your personal details on secure servers.": "Khi thu thập dữ liệu trên web, chúng tôi thu thập chi tiết cá nhân của bạn trên máy chủ an toàn.",
    "We use a firewall for the server. You should not send full credit or debit card details to us without encryption.": "Chúng tôi dùng tường lửa cho máy chủ. Bạn không nên gửi đầy đủ chi tiết của thẻ tín dụng hay thẻ ghi nợ khi chưa được mã hóa cho chúng tôi.",
    "We maintain physical and electronic safeguards in connection with the collection, storage and disclosure of your information.": "Chúng tôi duy trì các biện pháp bảo vệ vật lý và điện tử trong mối liên kết với thu thập, lưu trữ và tiết lộ thông tin của bạn.",
    "Our security procedures mean that we may sometimes require identification before disclosing personal information to you.": "Các thủ tục an toàn của chúng tôi nghĩa là chúng tôi có thể đôi khi yêu cầu giấy tờ chứng minh trước khi tiết lộ thông tin cá nhân cho bạn.",
    "We advise you that you should not give payment details to anyone by e-mail, we are not responsible for any loss you may incur in exchanging information. customers via internet or email.": "Chúng tôi khuyên quý khách rằng quý khách không nên đưa thông tin chi tiết về việc thanh toán với bất kỳ ai bằng e-mail, chúng tôi không chịu trách nhiệm về những mất mát quý khách có thể gánh chịu trong việc trao đổi thông tin của quý khách qua internet hoặc email.",
    "You absolutely do not use any programs, tools or other forms to interfere with the system or change the data structure.": "Quý khách tuyệt đối không sử dụng bất kỳ chương trình, công cụ hay hình thức nào khác để can thiệp vào hệ thống hay làm thay đổi cấu trúc dữ liệu.",
    "It is strictly forbidden to distribute, propagate or encourage any activities to interfere, sabotage or infiltrate the website system's data.": "Nghiêm cấm việc phát tán, truyền bá hay cổ vũ cho bất kỳ hoạt động nào nhằm can thiệp, phá hoại hay xâm nhập vào dữ liệu của hệ thống website.",
    "Any violation will result in the deprivation of all rights and will be prosecuted before the law if necessary.": "Mọi vi phạm sẽ bị tước bỏ mọi quyền lợi cũng như sẽ bị truy tố trước pháp luật nếu cần thiết.",
    "All transaction information will be kept confidential, but in case required by law enforcement, we will be forced to provide this information to legal authorities.": "Mọi thông tin giao dịch sẽ được bảo mật nhưng trong trường hợp cơ quan pháp luật yêu cầu, chúng tôi sẽ buộc phải cung cấp những thông tin này cho các cơ quan pháp luật.",
    "The terms, conditions and content of this website are governed by Vietnamese law and the Vietnamese courts have jurisdiction.": "Các điều kiện, điều khoản và nội dung của trang web này được điều chỉnh bởi luật pháp Việt Nam và tòa án Việt Nam có thẩm quyền xem xét.",
    "Personal data we collect": "Dữ liệu cá nhân chúng tôi thu thập",
    "Sensitive personal data we collect": "Dữ liệu cá nhân nhạy cảm chúng tôi thu thập",
    "Share your personal data": "Chia sẻ dữ liệu cá nhân của quý khách",
    "Third party providers": "Các nhà cung cấp bên thứ ba",
    "Your rights": "Các quyền của quý khách",
    "Data security": "Bảo mật dữ liệu",
    "Options center": "Trung tâm tùy chọn",
    "A cookie is a small text file that is stored on your computer, some only until you close your browser (also called “temporary cookies”) and some are stored for longer periods of time. (so-called “persistent cookies”).": "Cookie là một tập tin văn bản nhỏ được lưu trữ trên máy tính của quý khách, một số chỉ lưu cho đến khi quý khách đóng trình duyệt (còn gọi là “cookie tạm thời”) và một số được lưu trong khoảng thời gian dài (được gọi là “cookie dài hạn”).",
    "If you do not want to allow cookies to be stored on your computer, you can change the settings in your browser": "Nếu quý khách không muốn cho phép lưu trữ cookie trên máy tính của mình, quý khách có thể thay đổi cài đặt trong trình duyệt.",
    "However, please note that in some cases some of our website features may not function properly and therefore some content may not be displayed correctly.": "Tuy nhiên, xin lưu ý rằng trong một số trường hợp, một số tính năng trang web của chúng tôi có thể không hoạt động đúng cách và do đó một số nội dung có thể không được hiển thị chính xác.",
    "This site uses cookies for a number of reasons, including to provide a personalized experience, to improve the usability of this site and to collect usage statistics.": "Trang web này sử dụng cookie vì một số lý do, bao gồm cả việc cung cấp trải nghiệm được cá nhân hóa, để cải thiện tính khả dụng của trang web này và để thu thập số liệu thống kê sử dụng.",
    "We also use temporary cookies to improve the security of this site.": "Chúng tôi cũng sử dụng cookie tạm thời để cải thiện tính bảo mật của trang web này.",
    "In some cases when we use cookies, we share data with third parties.": "Trong một số trường hợp khi sử dụng cookie, chúng tôi chia sẻ dữ liệu với các bên thứ ba.",
    "For example, we use Google Analytics and Google AdWords, services that transmit website traffic data to Google servers.": "Ví dụ, chúng tôi sử dụng Google Analytics và Google AdWords, các dịch vụ truyền dữ liệu lưu lượng truy cập trang web đến các máy chủ của Google.",
    "Google Analytics does not identify individual users and does not associate your IP address with any other data held by Google.": "Google Analytics không nhận dạng người dùng cá nhân và không liên kết địa chỉ IP của quý khách với bất kỳ dữ liệu nào khác do Google lưu giữ.",
    "We use reports provided by Google to understand more about site traffic and site usage and optimize ads purchased from Google's own network and other advertising networks.": "Chúng tôi sử dụng các báo cáo do Google cung cấp để hiểu thêm về lưu lượng truy cập trang web và việc sử dụng trang web đồng thời tối ưu hóa các quảng cáo mua từ mạng riêng của Google và mạng lưới quảng cáo khác.",
    "Google may process data in the manner described in the Google Privacy Policy and for the purposes set out above in this section.": "Google có thể xử lý dữ liệu theo cách được mô tả trong Chính Sách Quyền Riêng Tư của Google và cho các mục đích được nêu ở trên trong phần này.",
    "You may choose to use Google Analytics if you disable or decline cookies, disable JavaScript, or use an opt-out service provided by Google.    ": "Quý khách có thể chọn sử dụng Google Analytics nếu quý khách vô hiệu hóa hoặc từ chối cookie, vô hiệu hóa JavaScript hoặc sử dụng dịch vụ chọn không sử dụng do Google cung cấp.",
    "Our website also uses the Facebook pixel - it collects anonymous aggregated data that helps us optimize advertising purchases across Facebook's various platforms (including Instagram).": "Trang web của chúng tôi cũng sử dụng pixel Facebook - nó thu thập dữ liệu tổng hợp ẩn danh giúp chúng tôi tối ưu hóa việc mua quảng cáo trên các nền tảng khác nhau của Facebook (bao gồm Instagram).",
    "Facebook collects a user id so they match if the user has visited a website with a Facebook pixel.": "Facebook thu thập một id người dùng để chúng khớp nhau nếu người dùng đã truy cập một trang web có pixel Facebook.",
    "However, we as advertisers can never identify the behavior of a particular user.": "Tuy nhiên, chúng tôi với tư cách là nhà quảng cáo không bao giờ có thể nhận dạng hành vi của một người dùng cụ thể.",
    "Facebook and its related platforms are part of a closed advertising ecosystem where their users can regulate if they consent to advertisers using data collected from their sites to buy ads. report on Facebook.": "Facebook và các nền tảng liên quan của Facebook nằm trong hệ sinh thái quảng cáo khép kín nơi người dùng chúng có thể điều chỉnh nếu họ chấp thuận cho các nhà quảng cáo sử dụng dữ liệu được thu thập từ trang web của họ để mua quảng cáo trên Facebook.",
    "Furthermore, our website uses conversion tracking scripts and cookies from Bing, ... (you can view their privacy policy using the following links).": "Hơn nữa, trang web của chúng tôi sử dụng các dòng lệnh theo dõi chuyển đổi và cookie từ Bing, ... (quý khách có thể xem chính sách quyền riêng tư của họ bằng các liên kết sau).",
    "All of these services collect aggregate statistical data that helps us optimize advertising purchases.": "Tất cả các dịch vụ này đều thu thập dữ liệu thống kê tổng hợp giúp chúng tôi tối ưu hóa việc mua quảng cáo.",
    "We as advertisers cannot identify a single user using this data.": "Chúng tôi với tư cách là nhà quảng cáo không thể nhận dạng một người dùng đơn lẻ sử dụng dữ liệu này.",
    "You can disable the use of cookies in your browser settings.": "Quý khách có thể tắt sử dụng cookie trong cài đặt trình duyệt của mình.",
    "To keep your personal data secure, we have implemented a number of technical and organizational security measures.": "Để giữ an toàn cho dữ liệu cá nhân của quý khách, chúng tôi đã triển khai một số biện pháp bảo mật kỹ thuật và có tổ chức.",
    "For example, we maintain high levels of technical security in all systems (including traceability, data disaster recovery, access restrictions, ...).": "Ví dụ, chúng tôi duy trì các mức độ bảo mật kỹ thuật cao trong tất cả các hệ thống (bao gồm truy xuất nguồn gốc, khôi phục dữ liệu sau thảm họa, hạn chế truy cập, ...).",
    "Additionally, we have put in place policies to ensure that our employees (subject of course to confidentiality obligations) do not use personal data unnecessarily.": "Ngoài ra, chúng tôi đã áp dụng các chính sách để đảm bảo rằng nhân viên của mình (tất nhiên phải tuân theo nghĩa vụ bảo mật) không sử dụng dữ liệu cá nhân khi không cần thiết.",
    "Such policies also set out our standards when we contract with suppliers or introduce new IT systems within our operations.": "Các chính sách như vậy cũng đặt ra các tiêu chuẩn của chúng tôi khi chúng tôi ký hợp đồng với các nhà cung cấp hoặc giới thiệu các hệ thống CNTT mới trong các hoạt động của chúng tôi.",
    "Typically, the type of personal data we collect is information we need to enable you to provide warranty and service support.": "Thông thường, loại dữ liệu cá nhân chúng tôi thu thập là thông tin chúng tôi cần để cho phép quý khách khách hàng hỗ trợ bảo hành và dịch vụ.",
    "This information includes information such as your full name, date of birth, phone number and email address.": "Thông tin này bao gồm các thông tin như họ và tên, ngày sinh, số điện thoại và địa chỉ email của quý khách.",
    "The personal data that we must receive in order to be able to help you arrange your order for products that you have placed through our website is the only data that is required to be provided.": "Dữ liệu cá nhân mà chúng tôi phải nhận được để có thể giúp quý khách sắp xếp đơn hàng sản phẩm mà quý khách đã đặt qua trang web của chúng tôi là dữ liệu duy nhất bắt buộc phải cung cấp.",
    "Depending on the type of travel service you use, we may also collect your frequent flyer number, information about your dietary requirements and health issues (if any). guests and other details relating to your travel arrangements or information requested by another travel service provider (such as airlines and hotels).": "Tùy thuộc vào loại dịch vụ du lịch quý khách sử dụng, chúng tôi cũng có thể thu thập mã số khách bay thường xuyên, thông tin về các yêu cầu về chế độ ăn uống và các vấn đề sức khỏe (nếu có) của quý khách cùng các thông tin chi tiết khác liên quan đến việc sắp xếp chuyến du lịch của quý khách hoặc thông tin được yêu cầu bởi một nhà cung cấp dịch vụ du lịch khác (chẳng hạn như hãng hàng không và khách sạn).",
    "This is not a complete list.": "Đây không phải là danh sách đầy đủ.",
    "If you call our support department, we will collect the data you provide during the call.": "Nếu quý khách gọi cho bộ phận hỗ trợ của chúng tôi, chúng tôi sẽ thu thập dữ liệu quý khách cung cấp trong khi gọi.",
    "As you can see below, our cookies also collect some information.": "Như quý khách có thể thấy bên dưới, các cookie của chúng tôi cũng thu thập một số thông tin.",
    "If you make a booking for someone else through our website, we will request that person's personal data.": "Nếu quý khách đặt chỗ trước cho người khác thông qua trang web của chúng tôi, chúng tôi sẽ yêu cầu dữ liệu cá nhân của người đó.",
    "In those cases, we expect you to inform those individuals of this privacy policy.": "Trong những trường hợp đó, chúng tôi mong quý khách sẽ thông báo cho các cá nhân đó về chính sách quyền riêng tư này.",
    "This website is operated by :name.": "Trang web này được điều hành bởi :name.",
    "We process a variety of personal data, such as names, email addresses and information related to the services I provide.": "Chúng tôi xử lý nhiều loại dữ liệu cá nhân, ví dụ như tên, địa chỉ email và thông tin liên quan đến dịch vụ tôi cung cấp.",
    "Therefore, we take data security very seriously and strictly comply with data protection laws.": "Do đó, chúng tôi rất coi trọng việc bảo mật dữ liệu và tuân thủ nghiêm ngặt luật bảo vệ dữ liệu.",
    "This privacy policy explains how we collect, store, use and disclose any personal data we collect about you when you use this website, and how we I protect your privacy and personal information security.": "Chính sách quyền riêng tư này giải thích cách chúng tôi thu thập, lưu trữ, sử dụng và tiết lộ bất kỳ dữ liệu cá nhân nào mà chúng tôi thu thập về quý khách khi quý khách sử dụng trang web này, cũng như cách chúng tôi bảo vệ quyền riêng tư và bảo mật thông tin cá nhân của quý khách.",
    "Your privacy is important to us so whether you're new to our services or are a long-time user, please take the time to learn about our practices - and get in touch. us if you have any questions.": "Quyền riêng tư của quý khách quan trọng với chúng tôi vì vậy dù quý khách mới sử dụng dịch vụ của chúng tôi hay là người dùng lâu năm, vui lòng dành thời gian để tìm hiểu các thông lệ của chúng tôi - và liên hệ với chúng tôi nếu quý khách có bất kỳ thắc mắc nào.",
    "How to contact us": "Cách liên hệ với chúng tôi",
    "If you have any questions regarding our processing of your personal data or our use of cookies, or if you wish to raise any of your rights under data protection law current, please send an email to: :mail or contact directly.": "Nếu quý khách có bất kỳ câu hỏi nào liên quan đến việc xử lý dữ liệu cá nhân của quý khách hoặc việc sử dụng cookie của chúng tôi, hoặc nếu quý khách muốn nêu lên bất kỳ quyền nào của mình theo luật bảo vệ dữ liệu hiện hành, vui lòng gửi email đến: :mail hoặc liên hệ trực tiếp.",
    "Privacy policy changes": "Các thay đổi về chính sách quyền riêng tư",
    "Where we change the way we process your personal data or use cookies, we will promptly update this privacy policy and publish it on this website.": "Trường hợp chúng tôi thay đổi cách xử lý dữ liệu cá nhân của quý khách hoặc cách sử dụng cookie, chúng tôi sẽ cập nhật kịp thời chính sách quyền riêng tư này và công bố chính sách đó trên trang web này.",
    "Under applicable data protection laws, you have certain rights as a “data subject”.": "Theo luật bảo vệ dữ liệu hiện hành, quý khách có một số quyền nhất định với tư cách là “đối tượng dữ liệu”.",
    "Below we have listed your rights.": "Dưới đây, chúng tôi đã liệt kê các quyền của quý khách.",
    "Your rights include:": "Các quyền của quý khách bao gồm:",
    "Access rights": "Quyền truy cập",
    "You have the right to access the personal data we process.": "Quý khách có quyền truy cập dữ liệu cá nhân mà chúng tôi xử lý.",
    "You are also entitled to receive certain information about what we do with your personal data.": "Quý khách cũng được quyền nhận các thông tin nhất định về những điều chúng tôi làm với dữ liệu cá nhân.",
    "This information is provided in this document.": "Những thông tin này được cung cấp trong tài liệu này.",
    "Right to amend": "Quyền sửa đổi",
    "In certain cases, you have the right to have inaccurate personal data relating to you corrected and to have incomplete personal data completed.": "Trong một số trường hợp nhất định, quý khách có quyền sửa các dữ liệu cá nhân không chính xác liên quan đến quý khách và hoàn thành các dữ liệu cá nhân chưa đầy đủ.",
    "Please note that we may not be able to correct inaccurate personal data provided by you due to, for example, airline rules and that such a particular change may incur costs .": "Xin lưu ý rằng chúng tôi có thể không sửa được dữ liệu cá nhân không chính xác do quý khách cung cấp do, ví dụ: các quy tắc của hãng hàng không và rằng sự thay đổi cụ thể đó có thể làm phát sinh chi phí.",
    "Right to deletion": "Quyền xóa bỏ",
    "In certain cases, you have the right to have your personal data erased.": "Trong một số trường hợp nhất định, quý khách có quyền xóa dữ liệu cá nhân của mình.",
    "This is called the “right to be forgotten”.": "Đây được gọi là “quyền được quên”.",
    "Right to restriction of processing": "Quyền hạn chế xử lý",
    "In certain circumstances, you have the right to restrict how we use your personal data.": "Trong một số trường hợp nhất định, quý khách có quyền hạn chế cách chúng tôi sử dụng dữ liệu cá nhân của quý khách.",
    "Right to data portability": "Quyền di chuyển dữ liệu",
    "You have the right to receive your personal data (or to have your personal data transmitted directly to another data controller) in a structured, commonly used and readable format. I.": "Quý khách có quyền nhận dữ liệu cá nhân của mình (hoặc để dữ liệu cá nhân được truyền trực tiếp đến một đơn vị kiểm soát dữ liệu khác) theo định dạng có cấu trúc, thường được sử dụng và có thể đọc được từ chúng tôi.",
    "Right to object": "Quyền phản đối",
    "You have the right to object to certain types of processing of your personal data that we carry out.": "Quý khách có quyền phản đối một số loại hình xử lý dữ liệu cá nhân mà chúng tôi thực hiện.",
    "This applies to all activities based on our \"legitimate interests\".": "Điều này áp dụng cho tất cả các hoạt động dựa trên \"lợi ích hợp pháp\" của chúng tôi.",
    "Finally, you also have the right to complain to the applicable data protection supervisory authority.": "Cuối cùng, quý khách cũng có quyền khiếu nại với cơ quan giám sát bảo vệ dữ liệu hiện hành.",
    "In some cases, we may process “special categories of personal data” about you, which may be considered sensitive.": "Trong một số trường hợp, chúng tôi có thể xử lý “các hạng mục dữ liệu cá nhân đặc biệt” về quý khách, có thể được coi là nhạy cảm.",
    "For example, if you (i) have submitted a medical certificate to avail of cancellation benefits or a refund from the airline (ii) have a medical or health condition that affects your trip go and you require assistance or where certain authorization is required, or (iii) have requested the disclosure of certain other sensitive personal data about you.": "Ví dụ, nếu quý khách (i) đã gửi giấy chứng nhận sức khỏe để sử dụng dịch vụ bảo vệ quyền lợi khi hủy hoặc để hoàn tiền từ hãng hàng không (ii) có tình trạng y tế hoặc sức khỏe ảnh hưởng đến chuyến đi và quý khách yêu cầu hỗ trợ hoặc khi cần sự cho phép nhất định, hoặc (iii) đã yêu cầu tiết lộ một số dữ liệu cá nhân nhạy cảm khác về quý khách.",
    "Before processing sensitive personal data about you, we will ask for your consent. ": "Trước khi xử lý các dữ liệu cá nhân nhạy cảm về quý khách, chúng tôi sẽ xin sự chấp thuận của quý khách.",
    "We therefore request that you use the dedicated contact forms on our website to submit any sensitive data.": "Do đó, chúng tôi yêu cầu quý khách sử dụng các biểu mẫu liên hệ chuyên dụng trên trang web của chúng tôi để gửi bất kỳ dữ liệu nhạy cảm nào.",
    "The contact forms allow you to provide us with the consent required under applicable data protection laws.": "Các biểu mẫu liên hệ cho phép quý khách cung cấp cho chúng tôi sự chấp thuận được yêu cầu theo luật bảo vệ dữ liệu hiện hành.",
    "You can of course withdraw this consent at any time.": "Tất nhiên quý khách có thể rút lại sự chấp thuận này bất cứ lúc nào.",
    "We will not process any sensitive personal data without your consent, or that you have not provided to us.": "Chúng tôi sẽ không xử lý bất kỳ dữ liệu cá nhân nhạy cảm nào không được quý khách cho phép, hoặc quý khách chưa cung cấp cho chúng tôi.",
    "A limited number of our employees will have access to your sensitive personal data and, after processing the sensitive data at your request, we will delete it as soon as possible.": "Một số lượng hạn chế nhân viên của chúng tôi sẽ có quyền truy cập dữ liệu cá nhân nhạy cảm của quý khách và sau khi xử lý dữ liệu nhạy cảm theo yêu cầu của quý khách, chúng tôi sẽ xóa dữ liệu sớm nhất có thể.",
    "In addition to the above, we take the necessary day-to-day measures for businesses providing services to consumers, such as bookkeeping, accounting, payments, anti-money laundering obligations and maintain the security of our website.": "Ngoài những điều trên, chúng tôi thực hiện các biện pháp hàng ngày cần thiết đối với các doanh nghiệp cung cấp dịch vụ cho người tiêu dùng, chẳng hạn như ghi sổ, kế toán, thanh toán, thực hiện nghĩa vụ chống rửa tiền và duy trì tính bảo mật trang web của chúng tôi.",
    "To the extent this is not required under applicable law, we take these measures based on our legitimate interests.": "Trong phạm vi điều này không bắt buộc theo luật hiện hành, chúng tôi thực hiện các biện pháp này dựa trên lợi ích hợp pháp của mình.",
    "We may also analyze customer behavior to improve our websites and services on a general level.": "Chúng tôi cũng có thể phân tích hành vi của khách hàng để cải thiện các trang web và dịch vụ của chúng tôi ở mức độ tổng quát.",
    "However, this analysis will use aggregated or anonymized data at an aggregate level.": "Tuy nhiên, hoạt động phân tích này sẽ sử dụng dữ liệu tổng quát hoặc ẩn danh ở mức độ tổng hợp.",
    "We will only share your personal data as necessary for the purposes listed in this privacy policy.": "Chúng tôi sẽ chỉ chia sẻ dữ liệu cá nhân của quý khách khi cần cho các mục đích được liệt kê trong chính sách quyền riêng tư này.",
    "May be shared with other companies in :domain, government agencies and our trusted business partners.": "Có thể chia sẻ cho các công ty khác trong :domain, các cơ quan chính phủ và các đối tác kinh doanh đáng tin cậy của chúng tôi.",
    "For example, we may share your personal data (including sensitive personal data where permitted) with business partners such as airlines, hotel suppliers, insurance companies and Global Distribution Systems (also known as GDS) to allow you to make travel arrangements and make travel reservations.": "Ví dụ chúng tôi có thể chia sẻ dữ liệu cá nhân của quý khách (bao gồm dữ liệu cá nhân nhạy cảm nếu được phép) với các đối tác kinh doanh như các hãng hàng không, nhà cung cấp khách sạn, công ty bảo hiểm và các Hệ Thống Phân Phối Toàn Cầu (còn gọi là GDS) để cho phép quý khách sắp xếp chuyến du lịch và đặt chỗ chuyến đi.",
    "What we do (our purposes for processing your personal data)": "Những điều chúng tôi làm (mục đích của chúng tôi khi xử lý dữ liệu cá nhân của quý khách)",
    "Our legal basis": "Cơ sở pháp lý của chúng tôi",
    "Storage time": "Thời gian lưu trữ",
    "Allows you to support the product services you have requested from us (i.e. booking travel services mediated by us, as well as providing our own services).": "Cho phép hỗ trợ chăm sóc dịch vụ sản phẩm mà quý khách đã yêu cầu từ chúng tôi (nghĩa là đặt các dịch vụ du lịch do chúng tôi làm trung gian, cũng như cung cấp các dịch vụ riêng của chúng tôi).",
    "Perform our contract with you.": "Thực hiện hợp đồng của chúng tôi với quý khách.",
    "Where you have provided us with sensitive personal data, consent is the legal basis.": "Khi quý khách đã cung cấp cho chúng tôi dữ liệu cá nhân nhạy cảm thì sự chấp thuận chính là cơ sở pháp lý.",
    "3 years from date of purchase.": "3 năm kể từ ngày mua.",
    "Consent to the processing of sensitive personal data can be withdrawn at any time.": "Sự chấp thuận cho phép xử lý dữ liệu cá nhân nhạy cảm có thể được rút lại bất cứ lúc nào.",
    "Depends on the type of cookie.": "Tùy thuộc vào loại cookie.",
    "If you do not want us to store cookies on your computer, you can change the settings in your browser at any time.": "Nếu quý khách không muốn chúng tôi lưu trữ cookie trên máy tính của quý khách, quý khách có thể thay đổi cài đặt trong trình duyệt bất cứ lúc nào.",
    "Our legitimate interests are (i) to improve our website, (ii) to show you offers that are of interest to you and (iii) to have a safe provision of services and website. full.": "Lợi ích hợp pháp của chúng tôi là (i) cải thiện trang web của chúng tôi, (ii) hiển thị cho quý khách các đề xuất mà quý khách quan tâm và (iii) có hoạt động cung cấp dịch vụ và trang web an toàn.",
    "We also use session cookies to improve the security of this site.": "Chúng tôi cũng sử dụng cookie phiên làm việc để cải thiện tính bảo mật của trang web này.",
    "Use cookies to, for example, improve the usability of this site, provide a personalized experience and collect usage statistics.": "Sử dụng cookie để, ví dụ, cải thiện tính khả dụng của trang web này, cung cấp trải nghiệm được cá nhân hóa và thu thập số liệu thống kê sử dụng.",
    "Only a limited number of people have access to your recordings.": "Chỉ có một số lượng người hạn chế có quyền truy cập bản ghi âm của quý khách.",
    "6 months from the date of the phone call.": "6 tháng kể từ ngày gọi điện thoại.",
    "If you do not want calls to be recorded, you can refuse recording before the recording begins.": "Nếu quý khách không muốn các cuộc gọi bị ghi âm, quý khách có thể từ chối việc ghi âm trước khi quá trình ghi âm bắt đầu.",
    "Our legitimate interests are (i) to improve our services through internal education and (ii) to deal with your possible requests or complaints.": "Lợi ích hợp pháp của chúng tôi là (i) cải thiện dịch vụ của chúng tôi thông qua giáo dục nội bộ và (ii) giải quyết các yêu cầu hoặc khiếu nại có thể có của quý khách.",
    "Record calls for quality assurance purposes and to serve any future requests or inquiries you may have.": "Ghi âm lại các cuộc gọi nhằm mục đích đảm bảo chất lượng và phục vụ bất kỳ yêu cầu hoặc thắc mắc nào trong tương lai của quý khách.",
    "Long-term storage": "Lưu trữ dài hạn",
    "If you do not want to receive these emails, you can opt out at any time within the email.": "Nếu quý khách không muốn nhận những email này, quý khách có thể chọn không nhận bất cứ lúc nào trong email.",
    "Our legitimate interest is to conduct business and allow you to complete your purchase without having to fill in all the information again.": "Lợi ích hợp pháp của chúng tôi là thực hiện kinh doanh và cho phép quý khách hoàn tất giao dịch mua của mình mà không phải điền lại tất cả thông tin.",
    "If you have started the warranty registration process, but have not completed it, we may send you an email with a link back to search results, or a booking that has already started, depending on when that your booking process on the website has been interrupted.": "Nếu quý khách đã bắt đầu quá trình đăng ký bảo hành, nhưng chưa hoàn tất, chúng tôi có thể gửi cho quý khách một email có liên kết quay lại kết quả tìm kiếm, hoặc đặt chỗ đã bắt đầu, tùy thuộc vào thời điểm mà quá trình đặt chỗ của quý khách trên trang web đã bị gián đoạn.",
    "Your user account data, as well as personal information related to product and service orders, will be saved until you decide to cancel your user account through our website.": "Dữ liệu tài khoản người dùng của bạn, cũng như thông tin cá nhân liên quan đến đơn hàng sản phẩm và dịch vụ, sẽ được lưu cho đến khi quý khách quyết định hủy tài khoản người dùng thông qua trang web của chúng tôi.",
    "We will also store your username and password.": "Chúng tôi cũng sẽ lưu trữ tên người dùng và mật khẩu của quý khách.",
    "Your account includes access to your previously purchased product warranty information.": "Tài khoản bao gồm quyền truy cập vào thông tin về việc bảo hành thông tin sản phẩm mua trước đó của quý khách.",
    "If you have chosen to create a user account on our website, we will provide that account to you.": "Nếu quý khách đã chọn tạo tài khoản người dùng trên trang web của chúng tôi, chúng tôi sẽ cung cấp tài khoản đó cho quý khách.",
    "Partners will be solely responsible for the processing of your personal data once received from us, meaning you must contact the partner in question with any related requests. to your rights under applicable data protection laws.": "Các đối tác sẽ tự chịu trách nhiệm về hoạt động xử lý dữ liệu cá nhân của quý khách sau khi nhận được từ chúng tôi, nghĩa là quý khách phải liên hệ với đối tác được đề cập khi có bất kỳ yêu cầu nào liên quan đến quyền của quý khách theo luật bảo vệ dữ liệu hiện hành.",
    "We recommend that you read their partners' respective privacy policies for information about how they process your personal data.": "Chúng tôi khuyên quý khách nên đọc các chính sách quyền riêng tư tương ứng của đối tác để biết thông tin về cách họ xử lý dữ liệu cá nhân của quý khách.",
    "We will also share your personal data with other companies (so-called “data processors”) necessary to provide the services you request, e.g. provide call center operator services and our other suppliers and vendors who process your personal data when providing their services to us (e.g. external storage ).": "Chúng tôi cũng sẽ chia sẻ dữ liệu cá nhân của quý khách với các công ty khác (được gọi là “các đơn vị xử lý dữ liệu”) cần thiết để cung cấp các dịch vụ quý khách yêu cầu, ví dụ như các nhà cung cấp dịch vụ điều hành các tổng đài và các nhà cung cấp và bên bán khác của chúng tôi, họ sẽ xử lý dữ liệu cá nhân của quý khách khi cung cấp dịch vụ của họ cho chúng tôi (ví dụ như bộ nhớ ngoài).",
    "Please note that our website contains links to other websites and offers content from third party providers.": "Xin lưu ý rằng trang web của chúng tôi chứa các liên kết đến các trang web khác và cung cấp nội dung từ các nhà cung cấp bên thứ ba.",
    "This privacy policy applies only to our website and services.": "Chính sách quyền riêng tư này chỉ áp dụng cho trang web và các dịch vụ của chúng tôi.",
    "When you click on links to other websites or use third party services and products, you should read their privacy policies.": "Khi quý khách nhấp vào các liên kết đến các trang web khác hoặc sử dụng các dịch vụ và sản phẩm của bên thứ ba, quý khách nên đọc các chính sách quyền riêng tư của họ.",
    "Additionally, if you choose to contact us via social media, this privacy policy will not apply to any personal data submitted by you as part of the contact process. - in this case, we advise you to read the privacy policy of that social media provider.": "Ngoài ra, nếu quý khách chọn liên hệ với chúng tôi qua phương tiện truyền thông xã hội thì chính sách quyền riêng tư này sẽ không áp dụng cho bất kỳ dữ liệu cá nhân nào do quý khách gửi như một phần của quá trình liên hệ - trong trường hợp này, chúng tôi khuyên quý khách nên đọc chính sách quyền riêng tư của nhà cung cấp phương tiện truyền thông xã hội đó.",
    "Password": "Mật khẩu",
    "Current password": " Mật khẩu cũ",
    "New password": "Mật khẩu mới",
    "Remember me": "Ghi nhớ tôi",
    "Forgot password": "Quên mật khẩu",
    "Password confirm": "Mật khẩu xác nhận",
    "Confirm password": "Xác nhận mật khẩu",
    "Birthdate": "Ngày sinh",
    "Gender": "Giới tính",
    "Choose": "Lựa chọn",
    "Male": "Nam",
    "Female": "Nữ",
    "N/A": "Không xác định",
    "Agree with": "Đồng ý với",
    "and": "và",
    "Loading...": "Đang tải...",
    "Recovery Codes": "Mã khôi phục",
    "Recovery Code": "Mã khôi phục",
    "Scan the QR code and enter the confirmation code to complete": "Quét mã QR và nhập mã xác nhận để hoàn tất",
    "The provided two factor authentication code was invalid.": "Mã xác thực hai yếu tố được cung cấp không hợp lệ.",
    "Enabled two-step verification successfully!": "Bật xác thực hai bước thành công!",
    "Turn off two-step verification successfully!": "Tắt xác thực hai bước thành công!",
    "Changed theme successfully!": "Đã thay đổi chủ đề thành công!",
    "Logged in successfully!": "Đăng nhập thành công!",
    "Signed out successfully!": "Đăng xuất thành công!",
    "Register successfully!": "Đăng ký thành công!",
    "Password changed successfully!": "Thay đổi mật khẩu thành công!",
    "Profile updated successfully!": "Cập nhật hồ sơ thành công!",
    "Account deleted successfully!": "Xóa tài khoản thành công!",
    "Password confirmation successful!": "Xác nhận mật khẩu thành công!",
    "Password confirmation required.": "Yêu cầu xác nhận mật khẩu.",
    "The provided password was incorrect.": "Mật khẩu được cung cấp không chính xác.",
    "Account management": "Quản lý tài khoản",
    "Dashboard": "Bảng điều khiển",
    "Profile": "Hồ sơ",
    "Change password": "Đổi mật khẩu",
    "Profile edit": "Sửa hồ sơ",
    "Profile destroy": "Xóa hồ sơ",
    "Enabled": "Đã bật",
    "Enable": "Bật",
    "Disabled": "Đã tắt",
    "Disable": "Tắt",
    "Setup": "Thiết lập",
    "Code": "Mã",
    "Confirm": "Xác nhận",
    "Logout": "Đăng xuất",
    "Submit": "Xác nhận",
    "Avatar": "Ảnh đại diện",
    "Province": "Tỉnh/Thành phố",
    "District": "Quận/Huyện/Thị xã",
    "Sub district": "Xã/Phường/Thị trấn",
    "Two step authentication": "Xác thực 2 bước",
    "Fast authentication": "Xác thực nhanh",
    "Complete two-step verification to sign in": "Hoàn tất xác minh hai bước để đăng nhập",
    "Complete two-step verification!": "Hoàn tất xác minh hai bước!",
    "Authentication": "Xác thục",
    "Add-ons": "Tiện ích bổ sung",
    "Select New Administrator": "Chọn Quản trị viên mới",
    "Empty board!": "Bảng trống!",
    "Select Permissions": "Chọn Quyền",
    "Added Administrator successfully!": "Thêm Quản trị viên thành công!",
    "Customer view": "Trang người dùng",
    "Models": "Mô hình",
    "Summary of programming courses": "Tổng hợp Khóa học lập trình",
    "The subject is already in the Database": "Môn học đã có trong Cơ sở dữ liệu",
    "Welcome to the top programming course aggregator!": "Chào mừng bạn đến với trang tổng hợp khóa học lập trình hàng đầu!",
    "We offer a variety of programming courses, from basic to advanced, to help you improve your programming skills.": "Chúng tôi cung cấp các khóa học lập trình đa dạng, từ cơ bản đến nâng cao, giúp bạn nâng cao kỹ năng lập trình của mình.",
    "With courses in Python, Java, JavaScript, and many other languages, you have the opportunity to learn syntax, programming logic, and practice through real-life projects.": "Với các khóa học về Python, Java, JavaScript, và nhiều ngôn ngữ khác, bạn có cơ hội học cú pháp, logic lập trình và thực hành thông qua dự án thực tế.",
    "Experienced teaching staff ensure your learning brings real value. Explore new opportunities with us today!": "Đội ngũ giảng viên giàu kinh nghiệm đảm bảo việc học của bạn mang lại giá trị thực tế. Hãy khám phá cơ hội mới cùng chúng tôi ngay hôm nay!",
    "Summary of Tools": "Tổng hợp Công cụ",
    "Diverse sources of documents and information to support those who are passionate about programming and Information Technology": "Nguồn tài liệu và thông tin đa dạng, nhằm hỗ trợ cho những người đam mê lập trình và Công nghệ thông tin",
    "We've compiled useful tools, resources, and information to help you improve your programming skills, learn IT, and solve problems related to the industry.": "Chúng tôi đã tổng hợp các công cụ, tài liệu, và thông tin hữu ích để giúp bạn nâng cao kỹ năng lập trình, học tập về CNTT, và giải quyết các vấn đề liên quan đến ngành này.",
    "Showing": "Hiển thị",
    "to": "đến",
    "of": "của",
    "results": "kết quả",
    "Popular Playlists": "Danh sách phát Phổ biến",
    "Playlists": "Danh sách phát",
    "Playlist": "Danh sách phát",
    "Albums": "Bộ sưu tập",
    "Album": "Đĩa đơn",
    "Release date": "Ngày phát hành",
    "Total tracks": "Tổng số bài",
    "Artist": "Nghệ sĩ",
    "Artists": "Nghệ sĩ",
    "Followers": "Người theo dõi",
    "Popularity": "Độ phổ biến",
    "Genres": "Thể loại",
    "Owner": "Chủ sở hữu",
    "Label": "Nhãn",
    ":number followers": ":number người theo dõi",
    ":number lessons": ":number bài học",
    ":number subjects": ":number môn học",
    "Summary of :name courses from Youtube": "Tổng hợp khóa học :name từ Youtube",
    "Updated at :time": "Cập nhật lúc :time",
    "Publish at :time": "Xuất bản lúc :time",
    "Publish at": "Xuất bản lúc",
    "Introduce: :description": "Giới thiệu: :description",
    "Lessons from :name": "Bài học từ :name",
    "Subjects from :name": "Môn học từ :name",
    "Result": "Kết quả",
    "Run": "Chạy",
    "Delete": "Xóa",
    "Copy": "Sao chép",
    "Download": "Tải xuống",
    "Options": "Tùy chọn",
    "String creation method": "Phương pháp tạo chuỗi",
    "By Choice": "Theo Lựa chọn",
    "By Character": "Theo Ký tự",
    "Other options": "Tùy chọn khác",
    "Lowercase characters (a-z)": "Ký tự in thường (a-z)",
    "Uppercase characters (A-Z)": "Ký tự in hoa (A-Z)",
    "Numeric characters (0-9)": "Ký tự số (0-9)",
    "Special characters": "Ký tự đặc biệt",
    "Custom string": "Chuỗi tùy chỉnh",
    "Enter Custom String (At least 1 character)": "Nhập Chuỗi tùy chỉnh (Ít nhất 1 ký tự)",
    "Alphanumeric (a-z A-Z 0-9)": "Chữ và số (a-z A-Z 0-9)",
    "Letters (a-z A-Z)": "Chữ (a-z A-Z)",
    "Hexadecimal (0-9 a-f)": "Thập lục phân (0-9 a-f)",
    "Binary (01)": "Nhị phân (01)",
    "Octal (0-7)": "Bát phân (0-7)",
    "Number of strings": "Số lượng chuỗi",
    "Length of each string": "Độ dài mỗi chuỗi",
    "How to list": "Cách liệt kê",
    "Separate line": "Dòng riêng biệt",
    "Same line": "Cùng một dòng",
    "Separator": "Dấu phân cách",
    "Enter Separator": "Nhập Dấu phân cách",
    "Type pressing": "Ép kiểu",
    "No": "Không",
    "Yes": "Có",
    "Next lesson": "Bài học tiếp theo",
    "Converts the entire string to lowercase characters": "Chuyển toàn bộ chuỗi về ký tự in thường",
    "Convert all characters to uppercase": "Chuyển toàn bộ về ký tự in hoa",
    "Remove hard-to-see characters": "Loại bỏ ký tự khó nhìn",
    "Document": "Văn bản",
    "Enter Text": "Nhập Văn bản",
    "Encode": "Mã hóa",
    "Decryption": "Giải mã",
    "Algorithm": "Thuật toán",
    "Cryptographic Function": "Hàm Mật mã",
    "Hash Function": "Hàm Băm",
    "Key": "Khóa",
    "Enter Key": "Nhập Khóa",
    "Albums from :name": "Bộ sưu tập từ :name",
    "Related Artists": "Nghệ sĩ liên quan",
    "Surf Spotify music": "Lướt nhạc Spotify",
    "Spotify provides a Music Search feature by diverse genres, from Pop, Rock, Hip-hop, EDM to many other genres": "Spotify cung cấp tính năng Tìm kiếm nhạc theo thể loại đa dạng, từ Pop, Rock, Hip-hop, EDM đến nhiều thể loại khác",
    "Users can easily explore playlists and expand their music listening experience": "Người dùng có thể dễ dàng khám phá danh sách phát và mở rộng trải nghiệm nghe nhạc của mình",
    "This feature not only helps users discover new music but also provides a diverse music listening space that suits personal preferences": "Tính năng này không chỉ giúp người dùng khám phá những bản nhạc mới mẻ mà còn mang đến không gian nghe nhạc đa dạng và phù hợp với sở thích cá nhân",
    "Input Query": "Nhập Từ khóa",
    "Outstanding Channels": "Kênh nổi bật",
    "Outstanding Lessons": "Bài học nổi bật",
    "Outstanding Subjects": "Môn học nổi bật",
    "Outstanding Courses": "Khóa học nổi bật",
    "The requested data was not found!": "Không tìm thấy dữ liệu được yêu cầu!!"
}
